{
    "message": "success",
    "results": {
        "hits": [
            {
                "content": "A photo of asteroid (253) Mathilde taken by NEAR\rAn asteroid is a space rock. It is a small object in the Solar System that travels around the Sun. It is like a planet but smaller. They range from very small (smaller than a car) to 600 miles (1000 km) across. A few asteroids have asteroid moon.\r\rThe name \"asteroid\" means \"like a star\" in the ancient Greek language. Asteroids may look like small stars in the sky, but they really do move around the Sun, while stars only seem to move because the Earth spins. Like planets, asteroids do not make their own light. Because of this, some people think \"asteroids\" is not a good name, and think that the name \"planetoid\" (\"like a planet\") would be a better name.\r\rGiuseppe Piazzi found the first asteroid, in 1801. He called it Ceres, and it is the biggest object in the asteroid belt. Others, like Juno, Pallas, and Vesta were found later. In the 1850s so many had been found, that they were numbered by a Minor planet designation starting with 1 Ceres. Today, astronomers using computerized telescopes find thousands of asteroids every month. Asteroid impact prediction is one of the purposes. \r\rAsteroids are the leftover rock and other material from the formation of the Solar System. These rocks were too small to come together to make a planet. Some are made of carbon or metal. Depending on what's on the surface, they are classified into various asteroid spectral types including Type M (metal), Type S (stone), and Type C (carbon).\r\rMost asteroids in our Solar System are in the asteroid belt between Mars and Jupiter. Many are not in the main asteroid belt. The ones that come close to Earth are called Near-Earth asteroids. Many scientists think asteroids striking the Earth killed off all the dinosaurs and caused some of the other extinction events.\r\r",
                "docDate": 1603542286000,
                "domain": "s.wikipedia.org",
                "title": "Asteroid ",
                "url": "http://s.wikipedia.org/wiki/Asteroid",
                "_id": "27",
                "_highlights": {
                    "title": "Asteroid"
                },
                "_score": 0.6902418
            },
            {
                "content": "Diagram of a comet's orbit\rA comet is a ball of mostly ice that moves around in outer space. Comets are often described as \"dirty snowballs\". They are very different from asteroids. The orbital inclinations of comets are usually high and not near the ecliptic where most solar system objects are found. Most of them are long-period comets and come from the Kuiper belt. That is very far away from the Sun, but some of them also come near enough to Earth for us to see at night. \r\rThey have long \"tails\", because the Sun melts the ice. A [https://factshungry.com/interesting-facts-about-comets-for-kids/amp/ comet's tail] does not trail behind it, but points directly away from the Sun, because it is blown by the solar wind.\rThe hard centre of the comet is the nucleus. It is one of the blackest things (lowest albedo) in the solar system. When light shone on the nucleus of Halley's Comet, the comet reflected only 4% of the light back to us.\r\rPeriodic comets visit again and again. Non-periodic or single-apparition comets visit only once.\r\rComets sometimes break up, as [https://factshungry.com/interesting-facts-about-comets-for-kids/amp/ Comet Biela] did in the 19th century. Comet Shoemaker-Levy 9 broke up, and the pieces hit Jupiter in 1994. Some comets orbit (go around) together in groups. Astronomers think these comets are broken pieces that used to be one object.\r\rFamous comets \r\rHalley's Comet\rHale-Bopp\rShoemaker-Levy 9\rIkeya seki\r\rHistory of comets \rFor thousands of years, people feared comets. They did not know what they were, or where they came from. Some thought that they were fireballs sent from demons or gods to destroy the earth. They said that each time a comet appeared, it would bring bad luck with it. Whenever a comet appeared, a king would die. For example, the Bayeux Tapestry shows the return of Halley's Comet and the death of a king. Comets were also known to end wars and thought to bring famine. During the Renaissance, astronomers started to look at comets with less superstition and to base their science on observations. Tycho Brahe reasoned that comets did not come from the earth, and his measurements and calculations showed that comets must be six times farther than the earth is from the moon.\r\rEdmond Halley reasoned that some comets are periodic, that is, they appear again after a certain number of years, and again and again. This led to the first prediction of a comet's return, Halley's Comet, named after him.\r\rIsaac Newton also studied comets. He realised that comets make U-turns around the sun. He asked his friend Edmond Halley to publish this in his book Philosophiae Naturalis Principia Mathematica. Before Newton said this, people believed that comets go in to the sun, then another comes out from behind the sun. \r\rIn later years some astronomers thought comets were spit out by planets, especially Jupiter.\r\rAll this new information and research gave people confidence, but some still thought that comets were messengers from the gods. One 18th century vision said that comets were the places that hell was, where souls would ride, being burned up by the heat of the sun and frozen by the cold of space.\r\rIn modern times space probes have visited comets to learn more about them.\r\rRelated pages\rList of comets\r\rOther websites \r[http://stevechallis.net/Comets.php Are Comets Made of Antimatter?] \r\r",
                "docDate": 1620875274000,
                "domain": "s.wikipedia.org",
                "title": "Comet ",
                "url": "http://s.wikipedia.org/wiki/Comet",
                "_id": "89",
                "_highlights": {
                    "title": "Comet"
                },
                "_score": 0.6444323
            },
            {
                "content": "Animals are living creatures with many cells. Animals are eukaryotic. They do not use light to get energy as plants do. Animals use different ways to get energy from other living things. They may eat other living things, though some are parasites or have photosynthetic protists as symbionts.\r\rMost animals are mobile, meaning they can move around. Animals take in oxygen, and give out carbon dioxide.Cresswell, Julia 2010. The Oxford Dictionary of word origins. 2nd ed, New York: Oxford University Press. ISBN 978-0-19-954793-7 'having the breath of life', from anima 'air, breath, life'. This cellular respiration is part of their metabolism (chemical working). In both these ways they are different from plants. Also, the cells of animals have different cell membranes to other eukaryotes like plants and fungi. The study of animals is called zoology.Alexander, R. McNeill 1990. Animals. Cambridge University Press. Cambridge. IBSN 0-521-34865-XVille C.A; Walker W.F. & Barnes R.D. 1984. General zoology. SaundersHamilton, Gina. Kingdoms of life – Animals. Lorenz Educational Press. \r\rPlants are also multicellular eukaryotic organisms, but live by using light, water and basic elements to make their tissues.\r\rGrouping animals\rThere are many different types of animals. The common animals most people know are only about 3% of the animal kingdom. When biologists look at animals, they find things that certain animals have in common. They use this to group the animals in a biological classification. They think several million species exist but they have only identified about one million.\r\rAnimals can mainly be divided into two main groups: the invertebrates and the vertebrates. Vertebrates have a backbone, or spine; invertebrates do not.\r\rVertebrates are:\rfish (or 'fishes': both ways are correct)\ramphibians\rreptiles\rbirds\rmammals\r\rSome invertebrates are:\rinsects\rspiders\rcrustaceans\rmolluscs (like a snail or squid)\rworms\rjellyfish\r\rLife styles\rThe animal mode of nutrition is called heterotrophic because they get their food from other living organisms. Some animals eat only plants; they are called herbivores. Other animals eat only meat and are called carnivores. Animals that eat both plants and meat are called omnivores.\r\rThe environments animals live in vary greatly. By the process of evolution, animals adapt to the habitats they live in. A fish is adapted to its life in water and a spider is adapted to a life catching and eating insects. A mammal living on the savannahs of East Africa lives quite a different life from a dolphin or porpoise catching fish in the sea.\r\rThe fossil record of animals goes back about 600 million years to the Ediacaran period, or somewhat earlier. [https://web.archive.org/web/20160429025317/http://www.princeton.edu/geosciences/people/maloof/papers_pub/24Maloof.pdf Pdf]. These fossils are interpreted as being early sponges. They were found in 665-million-year-old rock. During the whole of this long time, animals have been constantly evolving, so that the animals alive on Earth today are very different from those on the edges of the sea-floor in the Ediacaran. The study of ancient life is called palaeontology.\r\rEveryday language \rIn scientific usage, humans are animals. But in everyday use, humans are often not regarded as animals.\r\rRelated pages\r\rList of animal phyla\rEthology, the study of animal behaviour\r\rReferences\rCategory:Animals\rCategory:Basic English 850 words",
                "docDate": 1619711490000,
                "domain": "s.wikipedia.org",
                "title": "Animal ",
                "url": "http://s.wikipedia.org/wiki/Animal",
                "_id": "35",
                "_highlights": {
                    "title": "Animal"
                },
                "_score": 0.6382277
            },
            {
                "content": "Civics is the study of government. It most often refers to studying government in high school to prepare to be a good citizen. In college, civics is usually called political science. Since a city has the most unsimple government problems, the word for this study is like that for city.\r\rTheories of civics can be grouped as:\r\rAnarchist\rCapitalist\rDemocrat\rGreen\rLibertarian\rRepublican\r\rCategory:Politics",
                "docDate": 1557360953000,
                "domain": "s.wikipedia.org",
                "title": "Civics ",
                "url": "http://s.wikipedia.org/wiki/Civics",
                "_id": "83",
                "_highlights": {
                    "title": "Civics"
                },
                "_score": 0.6342641
            },
            {
                "content": "Australia, formally the Commonwealth of Australia, is a country and sovereign state in the southern hemisphere, located in Oceania. Its capital city is Canberra, and its largest city is Sydney.\r\rAustralia is the sixth biggest country in the world by land area, and is part of the Oceanic and Australasian regions. Australia, New Zealand, New Guinea and other islands on the Australian tectonic plate are together called Australasia, which is one of the world's great ecozones. When other Pacific islands are included with Australasia, it is called Oceania.\r\r25 million people live in Australia, and about 85% of them live near the east coast. The country is divided up into six states and two territories, and more than half of Australia's population lives in and around the cities of Sydney, Melbourne, Brisbane, Perth, Canberra and Adelaide. The first people to live in the country were Indigenous Australians but most of them died from smallpox during colonization.\r\rAustralia is known for its mining (coal, iron, gold, diamonds and crystals), its production of wool, and as the world's largest producer of bauxite. Its emblem is a flower called the Golden Wattle.\r\rAustralia is also known for it’s animals and rich wildlife. A Kangaroo is the national symbol of Australia.\r\rGeography \r\rMap of Australia\r\rAustralia's landmass of 7,617,930 square kilometers is on the Indo-Australian plate. The continent of Australia, including the island of Tasmania, was separated from the other continents of the world many millions of years ago. Because of this, many animals and plants live in Australia that do not live anywhere else. These include animals like the kangaroo, the koala, the emu, the kookaburra, and the platypus.\r\rPeople first arrived in Australia more than 50,000 years ago. These native Australians are called the Australian Aborigines. For the history of Australia, see History of Australia.\r\rMost of the Australian colonies, having been settled from Britain, became mostly independent democratic states in the 1850s and all six combined as a federation on 1 January 1901. The first Prime Minister of Australia was Edmund Barton in 1901. Australia is a member of the United Nations and the Commonwealth of Nations. It is a parliamentary democracy and a constitutional monarchy with Elizabeth II as Queen of Australia and Head of State and a Governor-General who is chosen by the Prime Minister to carry out all the duties of the Queen in Australia.\r\rRegions and cities \rAustralia has six states, two major mainland territories, and other minor territories. The states are New South Wales, Queensland, South Australia, Tasmania, Victoria, and Western Australia. The two major mainland territories are the Northern Territory and the Australian Capital Territory (ACT).\r\rIn 2013 according to world bank Australia had just over 23.13 million people. Most Australians live in cities along the coast, such as Sydney, Melbourne, Brisbane, Perth, Darwin, Hobart and Adelaide. The largest inland city is Canberra, which is also the nation's capital. The largest city is Sydney.\r\rAustralia is a very big country, but much of the land is very dry, and the middle of the continent is mostly desert. Only the areas around the east, west and south coast have enough rain and a suitable climate (not too hot) for many farms and cities.\r\rHistory \rAboriginal people \rPhotograph of Arrernte men of Central Australia in a Corroboree in 1900.\r\rThe Australian Aboriginal people arrived in Australia about 50,000 years ago or even earlier.Hesp, Patrick A. et al 1999. Aboriginal occupation on Rottnest Island, Western Australia, provisionally dated by aspartic acid racemisation assay of land snails to greater than 50 ka. Australian Archaeology, No 49 (1999) Until the arrival of British settlers in 1788, the Aboriginal people lived by hunting and gathering food from the land. They lived in all sorts of climates and managed the land in different ways. An example of Aboriginal land management was the Cumberland Plain where Sydney is now. Every few years the Aboriginal people would burn the grass and small trees. This meant that a lot of grass grew back, but not many big trees. Kangaroos like to live on grassy plains, but not in forests. The kangaroos that lived on the plain were a good food supply for the Aboriginal people. Sometimes, Aborigines would name a person after an animal, and they could not eat that animal to help level out the food population.\r\rAboriginal people did not usually build houses, except huts of grass, leaves and bark. They did not usually build walls or fences, and there were no horses, cows or sheep in Australia that needed to be kept in pens. The only Aboriginal buildings that are known are fish-traps made from stones piled up in the river, and the remains of a few stone huts in Victoria and Tasmania. The Aboriginal people did not use metal or make pottery or use bows and arrows or weave cloth. In some parts of Australia the people used sharp flaked-stone spearheads, but most Aboriginal spears were made of sharply pointed wood. Australia has a lot of trees that have very hard wood that was good for spear making. The boomerang was used in some areas for sport and for hunting.\r\rThe Aboriginal people did not think that the land belonged to them. They believed that they had grown from the land, so it was like their mother, and they belonged to the land.\r\rTerra Australis \rIn the 1600s, Dutch merchants traded with the islands of Batavia (now Indonesia), to the north of Australia and several different Dutch ships touched on the coast of Australia. The Dutch governor, van Diemen, sent Abel Tasman on a voyage of discovery and he found Tasmania, which he named Van Diemen's Land. Its name was later changed to honour the man who discovered it.\r\rThe British Government was sure that there must be a very large land in the south, that had not been explored. They sent Captain James Cook to the Pacific Ocean. His ship, HMS Endeavour, carried the famous scientists, Sir Joseph Banks and Dr Solander who were going to Tahiti where they would watch the planet Venus pass in front of the Sun. Captain Cook's secret mission was to find \"Terra Australis\" (the Land of the South).\r\rThe voyage of discovery was very successful, because they found New Zealand and sailed right around it. Then they sailed westward. At last, a boy, William Hicks, who was up the mast spotted land on the horizon. Captain Cook named that bit of land Point Hicks. They sailed up the coast and Captain Cook named the land that he saw \"New South Wales\". At last they sailed into a large open bay which was full of fish and stingrays which the sailors speared for food. Joseph Banks and Dr. Solander went ashore and were astonished to find that they did not know what any of the plants or birds or animals that they saw were. They collected hundreds of plants to take back to England.\r\rCaptain Cook saw the Aboriginal people with their simple way of life. He saw them fishing and hunting and collecting grass seeds and fruit. But there were no houses and no fences. In most parts of the world, people put up a house and a fence or some marker to show that they own the land. But the Aboriginal people did not own the land in that way. They belonged to the land, like a baby belongs to its mother. Captain Cook went home to England and told the government that no-one owned the land. This would later cause a terrible problem for the Aboriginal people.\r\rSettlement \rCaptain Arthur Phillip raises the British flag at Sydney in 1788.\r\rIn the 1700s, in England, laws were tough, many people were poor and gaols (jails) were full. A person could be sentenced to death for stealing a loaf of bread. Many people were hanged for small crimes. But usually they were just thrown in gaol. Often they were sent away to the British colonies in America. But by the 1770s, the colonies in America became the United States. They were free from British rule and would not take England's convicts any more, so England needed to find a new and less populated place.\r\rBy the 1780s the gaols of England were so full that convicts were often chained up in rotting old ships. The government decided to make a settlement in New South Wales and send some of the convicts there. In 1788 the First Fleet of eleven ships set sail from Portsmouth carrying convicts, sailors, marines, a few free settlers and enough food to last for two years. Their leader was Captain Arthur Phillip. They were to make a new colony at the place that Captain Cook had discovered, named Botany Bay because of all the unknown plants found there by the two scientists.\r\rCaptain Phillip found that Botany Bay was flat and windy. There was not much fresh water. He went with two ships up the coast and sailed into a great harbor which he said was \"the finest harbor in the world!\" There were many small bays on the harbor so he decided on one which had a good stream of fresh water and some flat shore to land on. On 26 January 1788, the flag was raised and New South Wales was claimed in the name of King George III of England, and the new settlement was called Sydney.\r\rFor the first few years of the settlement, things were very difficult. No-one in the British Government had thought very hard about what sort of convicts should be sent to make a new colony. Nobody had chosen them carefully. There was only one man who was a farmer. There was no-one among the convicts who was a builder, a brick-maker or a blacksmith. No-one knew how to fix the tools when they broke. All of the cattle escaped. There were no cooking pots. All the plants were different so no-one knew which ones could be eaten. It was probable that everyone in the new colony would die of starvation.\r\rSomehow, the little group of tents with a hut for the Governor, Arthur Phillip, and another hut for the supply of food, grew into a small town with streets, a bridge over the stream, a windmill for grinding grain and wharves for ships. By the 1820s there was a fine brick house for the Governor. There was also a hospital and a convict barracks and a beautiful church which are still standing today. Settlements had spread out from Sydney, firstly to Norfolk Island and to Van Diemen's Land (Tasmania), and also up the coast to Newcastle, where coal was discovered, and inland where the missing cattle were found to have grown to a large herd. Spanish Merino sheep had been brought to Sydney, and by 1820, farmers were raising fat lambs for meat and also sending fine wool back to the factories of England.\r\rWhile the settlement was growing in New South Wales, it was also growing in Tasmania. The climate in Tasmania was more like that in England, and farmers found it easy to grow crops there.\r\rExploration \rGovernor Lachlan Macquarie was the 5th governor of New South Wales and one who though that Australia could be a rich and free place.\r\rBecause Australia is such a very large land, it was easy to think that it might be able to hold a very large number of people. In the early days of the colony, a great number of explorers went out, searching for good land to settle on.\rWhen the settlers looked west from Sydney, they saw a range of mountains which they called the Blue Mountains. They were not very high and did not look very rugged but for many years no-one could find their way through them. In 1813 Gregory Blaxland, William Lawson and a 17-year-old called William Charles Wentworth crossed the Blue Mountains and found land on the other side which was good for farming. A road was built and the governor, Lachlan Macquarie founded the town of Bathurst on the other side, 100 miles from Sydney.\r\rSome people, like Captain Charles Sturt were sure that there must be a sea in the middle of Australia and set out to find it. Many of the explorers did not prepare very well, or else they went out to explore at the hottest time of year. Some died like Burke and Wills. Ludwig Leichhardt got lost twice. The second time, he was never seen again. Major Thomas Mitchell was one of the most successful explorers. He mapped the country as he went, and his maps remained in use for more than 100 years. He travelled all the way to what is now western Victoria, and to his surprise and annoyance found that he was not the first white person there. The Henty brothers had come from Tasmania, had built themselves a house, had a successful farm and fed the Major and his men on roast lamb and wine.\r\rSelf government\r\rThe gold rushes of New South Wales and Victoria started in 1851 leading to large numbers of people arriving to search for gold. The population grew across south east Australia and made great wealth and industry. By 1853 the gold rushes had made some poor people, very rich.\r\rThe transportation of convicts to Australia ended in the 1840s and 1850s and more changes came. The people in Australia wanted to run their own country, and not be told what to do from London. The first governments in the colonies were run by governors chosen by London. Soon the settlers wanted local government and more democracy. William Wentworth started the Australian Patriotic Association (Australia's first political party) in 1835 to demand democratic government. In 1840, the city councils started and some people could vote. New South Wales Legislative Council had its first elections in 1843, again with some limits on who could vote. In 1855, limited self-government was given by London to New South Wales, Victoria, South Australia and Tasmania. In 1855, the right to vote was given to all men over 21 in South Australia. The other colonies soon followed. Women were given the vote in the Parliament of South Australia in 1895 and they became the first women in the world allowed to stand in elections.\r\rAustralians had started parliamentary democracies all across the continent. But voices were getting louder for all of them to come together as one country with a national parliament.\r\rThe Commonwealth of Australia \rA painting of the opening of the first Parliament of Australia, 9 May 1901, painted by Tom Roberts. Australia has had democracy since the 1850s.\rCountries of birth of Australian estimated resident population, 2006.Source:Australian Bureau of Statistics[http://www.ausstats.abs.gov.au/ausstats/subscriber.nsf/0/E0A79B147EA8E0B5CA2572AC001813E8/$File/34120_2005-06.pdf Australian Bureau of Statistics]. Retrieved 9 December 2007.\r\rUntil 1901, Australia was not a nation, it was six separate colonies governed by Britain. They voted to join together to form one new country, called the Commonwealth of Australia, in 1901. Australia was still part of the British Empire, and at first wanted only British or Europeans to come to Australia. But soon it had its own money, and its own Army and Navy.\r\rIn Australia at this time, the trade unions were very strong, and they started a political party, the Australian Labor Party. Australia passed many laws to help the workers.[https://web.archive.org/web/20070609093923/http://aec.gov.au/Elections/Australian_Electoral_History/wright.htm Women and the Right to Vote in Australia - Australian Electoral Commission]\r\rIn 1914, the First World War started in Europe. Australia joined in on the side of Britain against Germany, Austria-Hungary and the Ottoman Empire. Australian soldiers were sent to Gallipoli, in the Ottoman Empire. They fought bravely, but were beaten by the Turks. Today Australia remembers this battle every year on ANZAC Day. They also fought on the Western Front. More than 60,000 Australians were killed.\r\rAustralia had a really hard time in the Great Depression of the 1930s and joined Britain in a war against Nazi Germany when Hitler invaded Poland in 1939. But in 1941 lots of Australian soldiers were captured in the Fall of Singapore by Japan. Then Japan started attacking Australia and people worried about invasion. But with help from the United States Navy, the Japanese were stopped. After the war, Australia became a close friend of the United States.\r\rWhen the war ended, Australia felt that it needed many more people to fill the country up and to work. So the government said it would take in people from Europe who had lost their homes in the war. It did things like building the Snowy Mountains Scheme. Over the next 25 years, millions of people came to Australia. They came especially from Italy and Greece, other countries in Europe. Later they also came from countries like Turkey and Lebanon. An important new party, the Liberal Party of Australia was made by Robert Menzies in 1944 and it won lots of elections from 1949 until in 1972, then Gough Whitlam won for the Labor Party. Whitlam made changes, but he made the Senate unhappy and the Governor-General sacked him and forced an election in 1975. Then Malcolm Fraser won a few elections for the Liberal Party.\r\rIn the 1960s many people began coming to Australia from China, Vietnam, Malaysia and other countries in Asia. Australia became more multicultural. In the 1950s and 1960s Australia became one of the richest countries in the world, helped by mining and wool. Australia started trading more with America, than Japan. Australia supported the United States in wars against dictatorships in Korea and Vietnam and later Iraq. Australian soldiers also helped the United Nations in countries like East Timor in 1999.\r\rIn 1973, the famous Sydney Opera House opened. In the 1970s, 80s and 90s lots of Australian movies, actors and singers became famous around the world. In the year 2000, Sydney had the Summer Olympics.\r\rIn the 1980s and 90s, the Labor Party under Bob Hawke and Paul Keating, then the Liberal Party under John Howard made lots of changes to the economy. Australia had a bad recession in 1991, but when other Western countries had trouble with their economies in 2008, Australia stayed strong.\r\rToday Australia is a rich, peaceful and democratic country. But it still has problems. Around 4-5% of Australians could not get a job in 2010. A lot of land in Australia (like Uluru) has been returned to Aboriginal people, but lots of Aborigines are still poorer than everybody else. Every year the government chooses a big number of new people from all around the world to come as immigrants to live in Australia. These people may come because they want to do business, or to live in a democracy, to join their family, or because they are refugees. Australia took 6.5 million immigrants in the 60 years after World War Two, including around 660,000 refugees.\r\rJulia Gillard became the first woman Prime Minister of Australia in 2010 when she replaced her colleague Kevin Rudd of the Labor Party.\r\rPolitics \rThe chamber of the Australian House of Representatives in Canberra.\r\rAustralia is part of the Commonwealth of Nations. Australia is made up of six states, and two mainland territories. Each state and territory has its own Parliament and makes its own local laws. The Parliament of Australia sits in Canberra and makes laws for the whole country, also known as the Commonwealth or Federation.\r\rThe Federal government is led by the Prime Minister of Australia, who is the member of Parliament chosen as leader. The current Prime Minister is Scott Morrison.\r\rThe leader of Australia is the Prime Minister, although the Governor-General represents the Queen of Australia, who is also the Queen of Great Britain, as head of state. The Governor-General, currently His Excellency David Hurley, is chosen by the Prime Minister.\r\rCulture \rFormer prime minister Kevin Rudd helping out at the barbecue.\rAustralian fish and chips\r\rAustralia Day and Anzac Day are both Australian holidays. A Barbecue is traditionally eaten on those days. Australia was colonised by people from Britain, but today people from all over the world live there. English is the main spoken language, and Christianity is the main religion, though all religions are accepted and not everybody has a religion. Australia is multicultural, which means that all its people are encouraged to keep their different languages, religions and ways of life, while also learning English and joining in with other Australians.\r\rFamous Australian writers include the bush balladeers Banjo Paterson and Henry Lawson who wrote about life in the Australian bush. More modern famous writers include Peter Carey, Thomas Keneally and Colleen McCullough. In 1973, Patrick White won the Nobel Prize in Literature, the only Australian to have achieved this; he is seen as one of the great English-language writers of the twentieth century.\r\rAustralian music has had lots of world-wide stars, for example the opera singers Nellie Melba and Joan Sutherland, the rock and roll bands Bee Gees, AC/DC and INXS, the folk-rocker Paul Kelly (musician), the pop singer Kylie Minogue and Australian country music stars Slim Dusty and John Williamson. Australian Aboriginal music is very special and very ancient: it has the famous digeridoo woodwind instrument. didgeridoo\r\rAustralian TV has produced many successful programs for home and overseas - including Skippy the Bush Kangaroo, Home and Away and Neighbours - and produced such well known TV stars as Barry Humphries (Dame Edna Everage), Steve Irwin (The Crocodile Hunter) and The Wiggles. Major Australian subgroups such as the Bogan have been shown on Australian TV in shows such as Bogan Hunters and Kath & Kim.\r\rAustralia has two public broadcasters (the ABC and the multi-cultural SBS), three commercial television networks, three pay-TV services, and numerous public, non-profit television and radio stations. Each major city has its daily newspapers, and there are two national daily newspapers, The Australian and The Australian Financial Review.\r\rAustralian movies have a very long history. The world's first feature movie was the Australian movie The Story of the Kelly Gang of 1906.[http://aso.gov.au/titles/features/story-kelly-gang Video Overview The Story of the Kelly Gang (1906) on ASO - Australia's audio and visual heritage online] In 1933, In the Wake of the Bounty, directed by Charles Chauvel, had Errol Flynn as the main actor.[http://aso.gov.au/titles/features/wake-bounty/ Video Overview In the Wake of the Bounty (1933) on ASO - Australia's audio and visual heritage online] Flynn went on to a celebrated career in Hollywood. The first Australian Oscar was won by 1942's Kokoda Front Line!, directed by Ken G. Hall.[http://aso.gov.au/titles/newsreels/kokoda-front-line/ Video Overview Kokoda Front Line! (1942) on ASO - Australia's audio and visual heritage online] In the 1970s and 1980s lots of big Australian movies and movie stars became world famous with movies like Picnic at Hanging Rock, Gallipoli (with Mel Gibson), The Man From Snowy River and Crocodile Dundee.[http://wwwmcc.murdoch.edu.au/ReadingRoom/film/Croc.html \"Fair Dinkum Fillums\": the Crocodile Dundee Phenomenon] Russell Crowe, Cate Blanchett and Heath Ledger became global stars during the 1990s and Australia starring Nicole Kidman and Hugh Jackman made a lot of money in 2008.\r\rAustralia is also a popular destination for business conferences and research, with Sydney named as one of the top 20 meeting destinations in the world.\r\rSport \rDon Bradman.\r\rSport is an important part of Australian culture because the climate is good for outdoor activities. 23.5% Australians over the age of 15 regularly take part in organised sporting activities. In international sports, Australia has very strong teams in cricket, hockey, netball, rugby league and rugby union, and performs well in cycling, rowing and swimming. Local popular sports include Australian Rules Football, horse racing, soccer and motor racing. Australia has participated in every summer Olympic Games since 1896, and every Commonwealth Games. Australia has hosted the 1956 and 2000 Summer Olympics, and has ranked in the top five medal-winners since 2000. Australia has also hosted the 1938, 1962, 1982 and 2006 Commonwealth Games and are to host the 2018 Commonwealth Games. Other major international events held regularly in Australia include the Australian Open, one of the four Grand Slam tennis tournaments, annual international cricket matches and the Formula One Australian Grand Prix. Corporate and government sponsorship of many sports and elite athletes is common in Australia. Televised sport is popular; some of the highest-rated television programs include the Summer Olympic Games and the grand finals of local and international football competitions.\r\rThe main sporting leagues for males are the Australian Football League, National Rugby League, A-League and NBL.\rFor women, they are ANZ Netball Championships, W-League and WNBL.\r\rFamous Australian sports players include the cricketer Sir Donald Bradman, the swimmer Ian Thorpe and the athlete Cathy Freeman.\r\rArt festivals \r\rJust 60 years ago, Australia had only one big art festival. Now Australia has hundreds of smaller community-based festivals, and national and regional festivals that focus on specific art forms.\r\rWildlife \rAustralia is home to many animals that can be found nowhere else on Earth, which include: the koalas, the kangaroos, the wombat, the numbat, the emu, among many others. Most of the marsupials in the world are found only on the continent or on the neighbouring island of New Guinea. Wildfires from global warming in 2020 have decreased their population. \rNumbat\r\rReferences\r;Notes\r;References\rOther websites \r\r[http://www.australia.com Official website for australia travel] Official website for Australia travel.\r[http://www.australien-links.ch Australia travel informations] User generated guide to Australia.\r\r\rCategory:Australasia\rCategory:Gondwana\rCategory:Commonwealth realms\rCategory:English-speaking countries\rCategory:Federations\rCategory:1901 establishments",
                "docDate": 1622523231000,
                "domain": "s.wikipedia.org",
                "title": "Australia ",
                "url": "http://s.wikipedia.org/wiki/Australia",
                "_id": "13",
                "_highlights": {
                    "content": "Wildlife \rAustralia is home to many animals that can be found nowhere else on Earth, which include: the koalas, the kangaroos, the wombat, the numbat, the emu, among many others. Most of the marsupials in the world are found only on the continent or on the neighbouring island of New Guinea."
                },
                "_score": 0.63002557
            },
            {
                "content": "An abbreviation is a shorter way to write a word or phrase. People use abbreviations for words that they write a lot. The English language occasionally uses the apostrophe mark ' to show that a word is written in a shorter way, but some abbreviations do not use this mark. More often, they use periods, especially the ones that come from the Latin language. Common Latin abbreviations include i.e. [id est] that is, e.g. [exempli gratia] for example, and et al. [et alia] and others.\r\rSome new abbreviations have been created by scientists, by workers in companies and governments, and by people using the Internet.\r\rPeople often think words are abbreviations when in fact they are acronyms.\r\rHere are examples of common acronyms: The word \"radar\" is an acronym for \"Radio Detection and Ranging\". The name of the large computer company IBM comes from the words \"International Business Machines\". The name of the part of the United States government that sends rockets into outer space is NASA, from the words \"National Aeronautics and Space Administration\". When people using the Internet think that something is very funny, they sometimes write \"LOL\" to mean \"Laughing Out Loud\". People sometimes write \"ASAP\" for \"As Soon As Possible\".\r\rOther websites \r[http://www.acronymfinder.com Acronym Finder] - largest acronym site with many ways to search for acronyms and abbreviations in many languages. Over 10-year history.\r[http://www.all-acronyms.com All Acronyms] - a website with a large number of abbreviations and acronyms\r[http://acronymsandslang.com Acronyms Abbreviations and Slang] - over 3 million different acronyms and abbreviations in searchable database\r[https://www.slanglang.net/abbreviations/ SlangLang Abbreviations] - Slang Words: 2,700 abbreviations and their meanings\rCategory:Linguistics",
                "docDate": 1592473720000,
                "domain": "s.wikipedia.org",
                "title": "Abbreviation ",
                "url": "http://s.wikipedia.org/wiki/Abbreviation",
                "_id": "16",
                "_highlights": {
                    "content": "The name of the part of the United States government that sends rockets into outer space is NASA, from the words \"National Aeronautics and Space Administration\". When people using the Internet think that something is very funny, they sometimes write \"LOL\" to mean \"Laughing Out Loud\"."
                },
                "_score": 0.62819046
            },
            {
                "content": "The historic city of Istanbul (Turkey) with some notable sights.\r\rA city is a heavily inhabited community that may include structures, buildings, bridges, rivers or lakes, and landmarks.\r\rA city has many buildings and streets. It has houses, hotels, condominiums, and apartments for many people to live in, shops where they may buy things, places for people to work, and a government to run the city and keep law and order in the city. People live in cities because it is easy for them to find and do everything they want there. A city usually has a \"city center\" where government and business occur and suburbs where people live outside the center.\r\rDefinition\rTirana, capital of Albania\rNo rule is used worldwide to decide why some places are called \"city,\" and other places are called \"town.\"\r\rSome things that make a city are :\rA long history. Although many cities today have only been around for tens or hundreds of years, there are a few which have been so for thousands of years. For example, Athens, Greece was founded in 1000 BC and Rome, Italy has existed since 700 BC.\rA large population. Cities can have millions of people living in and around them. Among them are Tokyo, Japan, and the Tokyo Metropolis around it, which includes Yokohama and Chiba.\rIn Japan, the population of a city ( 市 ) is at least over 50,000 persons. and among cities, there are various grades according to laws, which the central government of Japan governs.\rA center where business and government takes place. The first case is often described as the financial capital, such as Frankfurt in Germany. The second case is true for different levels of government, whether they are local or part of a larger region (for example, Atlanta, Georgia, or the capital of the United States Washington, D.C.) Cities that contain the government of the region it is in are called capitals. Almost every country has its own capital.\rSpecial powers called town privileges which have been given by the government of the country or its ruler. Europe during the Middle Ages was a great example of having town privileges.\rHaving a cathedral or a university. This rule is found in the United Kingdom. The smallest \"cathedral cities\" are St. David's and St. Asaph's which are both in Wales, Ripon and Wells which are in England.\r\rIn American English, people often call all places where many people live cities.In the USA, on forms (papers asking for information), the word \"City\" is generally used for the place where a person lives, even if the person who wants to write in the form might live in a city, a town, or a village or hamlet (a tiny village). (See below: Size of cities )\r\rSize of cities\rThe River Thames is part of London's transport system. This picture shows the \"City of London.\" \rTokyo, is the world's most populous metropolitan area.\rThe sizes of cities can be very different. This depends on the type of city. Cities built hundreds of years ago and which have not changed much are much smaller than modern cities. There are two main reasons. One reason is that old cities often have a city wall, and most of the city is inside it. Another important reason is that the streets in old cities are often narrow. If the city got too big, it was hard for a cart carrying food to get to the marketplace. People in cities need food, and the food always has to come from outside the city. \r\rCities that were on a river like London could grow much bigger than cities that were on a mountain like Sienna in Italy, because the river made a transport route for carrying food and other goods, as well as for transporting people. London has been changing continually for hundreds of years, while Sienna, a significant city in the 1300s, has changed very little in 700 years. \r\rModern cities with modern transport systems can grow very large, because the streets are wide enough for cars, buses, and trucks, and there are often railway lines.\r\rIn the US, the word city is often used for towns that are not very big. When the first European people went to America, they named \" city \" to new places. They hoped the places would be great cities in the future. For example, Salt Lake City was the name given to a village of 148 people. When they started building the town, they made street plans and called it Great Salt Lake City (for the nearby Great Salt Lake). \r\rNow, 150 years later, it really is a big city.\r\rIn modern times many cities have grown bigger and bigger. The whole area is often called a \"metropolis\" and can sometimes include several small ancient towns and villages. The metropolis of London includes London, Westminster, and many old villages such as Notting Hill, Southwark, Richmond, Greenwich, etc. The part that is officially known as the \" City of London \" only takes up one square mile. The rest is known as \"Greater London. \" Many other cities have grown in the same way.\r\rThese giant cities can be exciting places to live, and many people can find good jobs there, but modern cities also have many problems. Many people cannot find jobs in the cities and have to get money by begging or by crime. Automobiles, factories, and waste create a lot of pollution that makes people sick.\r\rUrban history \rCarcassonne is an ancient city in France. \r\rUrban history is history of civilization. The first cities were made in ancient times, as soon as people began to create civilization . Famous ancient cities which fell to ruins included Babylon, Troy, Mycenae and Mohenjo-daro.\r\rBenares in northern India is one among the ancient cities which has a history of more than 3000 years. Other cities that have existed since ancient times are Athens in Greece, Rome and Volterra in Italy, Alexandria in Egypt and York in England.\r\rIn Europe, in the Middle Ages, being a city was a special privilege, granted by nobility. Cities that fall into this category, usually had (or still have) city walls. The people who lived in the city were privileged over those who did not. Medieval cities that still have walls include Carcassonne in France, Tehran in Iran, Toledo in Spain and Canterbury in England.\r\rFeatures \r\rInfrastructure \rA sewer built in Ancient Rome.\rPeople in a city live close together, so they cannot grow all their own food or gather their own water or energy. People also create waste and need a place to put it. Modern cities have infrastructure to solve these problems. Pipes carry running water, and power lines carry electricity. Sewers take away the dirty water and human waste. Most cities collect garbage to take it to a landfill, burn it, or recycle it.\r\rTransport is any way of getting from one place to another. Cities have roads which are used by automobiles (including trucks), buses, motorcycles, bicycles, and pedestrians (people walking). Some cities have trains and larger cities have airports. Many people in cities travel to work each day, which is called commuting.\r\rBuildings and design \rHouses and apartments are common places to live in cities. Great numbers of people in developing countries (and developed countries, in the past) live in slums. A slum is poorly built housing, without clean water, where people live very close together. Buildings are usually taller in the city center, and some cities have skyscrapers.\r\rCity streets can be shaped like a grid, or as a \"wheel and spokes\": a set of rings and lines coming out from the center. Streets in some older cities like London are arranged at random, without a pattern. The design of cities is a subject called urban planning. One area of the city might have only shops, and another area might have only factories. Cities have parks, and other public areas like city squares.\r\rUnited States politics\rDowntown Dallas, Texas, is a Democratic stronghold. \r\rCities in the US are usually very-left leaning. The best examples of these would be New York, New York, and Washington, D.C. For example, in Louisiana, the only Democratic delegate in US Congress who is a Democrat was elected from a district comprising in New Orleans. Below is a list of states and the major city/cities that provide much of the liberal support in them :\r\rAtlanta, Georgia: 5 of the 16 delegates representing Georgia in the US Congress are Democrats. All hail from districts in Atlanta.\rNew Orleans, Louisiana: the only Democratic delegate from Louisiana in the US Congress was elected from a New Orleans district.\rKansas City, Kansas: the only Democratic congressman from Kansas was elected from a district in Kansas City.\rLas Vegas, Nevada: all of the Democrats in the US House who represent Nevada are from Las Vegas.\rSalt Lake City, Utah: the only Democrat representing Utah in the US Congress was elected from a Salt Lake City district.\rChicago, Illinois: if it weren´t for Chicago, the state of Illinois would be as conservative as Indiana.\rLouisville, Kentucky: the only Democrat representing Kentucky in the US Congress was elected from a Louisville district.\r\rPolitics in the United States is not simple. If you would like to read a more in-depth and complicated version, please click https://en.wikipedia.org/wiki/Politics_of_the_United_States\rWorld's largest cities\rIn Rio de Janeiro, a city famous for its beauty, large slums lie between the richest districts. Many of the world's large cities have areas of poverty like this. \rThe capital of the Malaysian province of Kuala. The capital is Kuala Lumpur. \r\rThese cities have more than 10 million people and can be called megacities:\r\rTokyo, Japan - 37+ million\rMexico City, Mexico - 21 million\rMumbai, India - 20 million\rSão Paulo, Brazil - 18 million\rLagos, Nigeria - 13 million\rCalcutta, India - 13 million\rBuenos Aires, Argentina - 12 million\rSeoul, South Korea - 12 million\rBeijing, China - 12 million\rKarachi, Pakistan - 12 million\rDhaka, Bangladesh - 11 million\rManila, Philippines - 11 million\rCairo, Egypt - 11 million\rOsaka, Japan - 11 million\rRio de Janeiro, Brazil - 11 million\rTianjin, China - 10 million\rMoscow, Russia - 10 million\rLahore, Pakistan - 10 million\r\rGallery of cities\r\rFile:Los Angeles downtown.jpg - Los Angeles, USA\rFile:Antalya falezler.jpg - Antalya, in Turkey\rFile:Bangkok skytrain sunset.jpg - Bangkok, Thailand\rFile:Down Town Sydney.jpg - Sydney CBD\rImage:NYC wideangle south from Top of the Rock.jpg - New York City\rFile:Chicago aerial view.jpg - Chicago, USA\rFile:Warsaw7ob.jpg - Warsaw, in Poland \rReferences\r",
                "docDate": 1621496773000,
                "domain": "s.wikipedia.org",
                "title": "City ",
                "url": "http://s.wikipedia.org/wiki/City",
                "_id": "75",
                "_highlights": {
                    "content": "Features \r\rInfrastructure \rA sewer built in Ancient Rome. People in a city live close together, so they cannot grow all their own food or gather their own water or energy."
                },
                "_score": 0.62715185
            },
            {
                "content": ":Being is also a present tense part of to be\r\rThe word being means a living person or animal. ‘Human being’ means the same as ’person’. Men, women, and children are human beings.\r\rSome people write stories or make movies about beings from other planets. Most religions talk about supernatural beings, for example spirits, angels, devils, gods, or God.\r\rCategory:Philosophy\rCategory:Religion",
                "docDate": 1554082179000,
                "domain": "s.wikipedia.org",
                "title": "Being ",
                "url": "http://s.wikipedia.org/wiki/Being",
                "_id": "45",
                "_highlights": {
                    "content": "Men, women, and children are human beings. Some people write stories or make movies about beings from other planets."
                },
                "_score": 0.62696034
            },
            {
                "content": "April is the fourth month of the year, and comes between March and May. It is one of four months to have 30 days.\r\rApril always begins on the same day of week as July, and additionally, January in leap years. April always ends on the same day of the week as December.\r\rApril's flowers are the Sweet Pea and Daisy. Its birthstone is the diamond. The meaning of the diamond is innocence.\r\rThe Month \rSpring flowers in April in the Northern Hemisphere.\rApril comes between March and May, making it the fourth month of the year. It also comes first in the year out of the four months that have 30 days, as June, September and November are later in the year.\r\rApril begins on the same day of the week as July every year and on the same day of the week as January in leap years. April ends on the same day of the week as December every year, as each other's last days are exactly 35 weeks (245 days) apart.\r\rIn common years, April starts on the same day of the week as October of the previous year, and in leap years, May of the previous year. In common years, April finishes on the same day of the week as July of the previous year, and in leap years, February and October of the previous year. In common years immediately after other common years, April starts on the same day of the week as January of the previous year, and in leap years and years immediately after that, April finishes on the same day of the week as January of the previous year.\r\rIn years immediately before common years, April starts on the same day of the week as September and December of the following year, and in years immediately before leap years, June of the following year. In years immediately before common years, April finishes on the same day of the week as September of the following year, and in years immediately before leap years, March and June of the following year.\r\rApril is a spring month in the Northern Hemisphere and an autumn/fall month in the Southern Hemisphere. In each hemisphere, it is the seasonal equivalent of October in the other.\r\rIt is unclear as to where April got its name. A common theory is that it comes from the Latin word \"aperire\", meaning \"to open\", referring to flowers opening in spring. Another theory is that the name could come from Aphrodite, the Greek goddess of love. It was originally the second month in the old Roman Calendar, before the start of the new year was put to January 1.\r\rQuite a few festivals are held in this month. In many Southeast Asian cultures, new year is celebrated in this month (including Songkran). In Western Christianity, Easter can be celebrated on a Sunday between March 22 and April 25. In Orthodox Christianity, it can fall between April 4 and May 8. At the end of the month, Central and Northern European cultures celebrate Walpurgis Night on April 30, marking the transition from winter into summer.\r\rApril in poetry \rPoets use April to mean the end of winter. For example: April showers bring May flowers.\r\rEvents in April \rFixed Events \rAn April Fools' Day hoax for April 1 in Copenhagen.\rSongkran celebration in Thailand around April 14.\rProposed flag for Earth Day on April 22.\rSaint George's Day on April 23 in London's Trafalgar Square.\rANZAC Day commemoration in Australia on April 25.\rQueen's Day, April 30, celebration in the Netherlands. It changed to King's Day, April 27, in 2014.\rWalpurgis Night bonfire on April 30 in Sweden.\rApril 1 - April Fools' Day\rApril 1 - Islamic Republic Day (Iran)\rApril 2 - International Children's Book Day\rApril 2 - Thai Heritage and Conservation Day\rApril 2 - World Autism Awareness Day\rApril 2 - Malvinas Day (Argentina)\rApril 4 - Independence Day (Senegal)\rApril 4 - International Day for Landmine Awareness and Assistance\rApril 4 - Peace Day (Angola)\rApril 5 - End of Tax Year (United Kingdom)\rApril 6 - Tartan Day (Canada and United States)\rApril 6 - Chakri Day (Thailand)\rApril 7 - Day of Maternity and Beauty (Armenia)\rApril 7 - Genocide Memorial Day (Rwanda)\rApril 7 - World Health Day\rApril 7 - Women's Day (Mozambique)\rApril 8 - Buddha's Birthday (Buddhism)\rApril 9 - Martyrs' Day (Tunisia)\rApril 9 - Day of National Unity (Georgia)\rApril 9 - Day of the Finnish language\rApril 12 - Cosmonauts' Day (Russia), marking the day of Yuri Gagarin's space flight\rApril 13 - Songkan (Laos), local New Year celebration\rApril 13 - Cambodian New Year\rApril 13 - Thomas Jefferson's Birthday (United States)\rApril 14 - Southeast Asian New Year festivals, including Songkran\rApril 14 - Georgian language Day\rApril 14 - Youth Day (Angola)\rApril 14 - Ambedkar Tayanti (India)\rApril 14 - Pan-American Day\rApril 15 - Tax Day (United States)\rApril 15 - Kim Il-Sung's Birthday (North Korea)\rApril 15 - Father Damien Day (Hawaii)\rApril 15 - Jackie Robinson Day (Major League Baseball)\rApril 16 - Birthday of Queen Margrethe II of Denmark\rApril 16 - Emancipation Day (Washington, DC)\rApril 16 - World Voice Day\rApril 16 - Selena Day (Texas)\rApril 17 - National Day of Syria\rApril 17 - Flag Day (American Samoa)\rApril 17 - Women's Day (Gabon)\rApril 17 - World Hemophilia Day\rApril 18 - Independence Day (Zimbabwe)\rApril 18 - Invention Day (Japan)\rApril 18 - International Day of Monuments and Sites\rApril 19 - Bicycle Day\rApril 19 - Dutch-American Friendship Day\rApril 19 - Birthday of King Mswati III of Swaziland\rApril 19 - Patriots' Day (Massachusetts, Maine, Wisconsin)\rApril 20 - 4/20 in Cannabis Culture\rApril 21 - John Muir Day (California)\rApril 21 - San Jacinto Day (Texas)\rApril 21 - Kartini Day (Indonesia)\rApril 21 - National Tree Planting Day (Kenya)\rApril 21 - First Day of Ridran (Baha'i faith)\rApril 21 - Grounation Day (Rastafari movement)\rApril 22 - Earth Day\rApril 22 - Discovery Day (Brazil)\rApril 23 - Saint George's Day, celebrating the patron saint of several countries, regions and cities (including England and Catalonia)\rApril 23 - World Book Day\rApril 23 - National Sovereignty and Children's Day (Turkey)\rApril 24 - Democracy Day (Nepal)\rApril 24 - Genocide Day (Armenia)\rApril 24 - Republic Day (the Gambia)\rApril 25 - Australia and New Zealand celebrate ANZAC Day. [http://www.awm.gov.au/dawn/spirit/meaning.asp ANZAC] means Australian and New Zealand Army Corps, and began in 1915.\rApril 25 - World DNA Day\rApril 25 - World Malaria Day\rApril 25 - Flag Day (Swaziland, Faroe Islands)\rApril 25 - Freedom Day (Portugal)\rApril 25 - Liberation Day (Italy)\rApril 25 - Army Day (North Korea)\rApril 26 - Union Day (Tanzania)\rApril 26 - Confederate Memorial Day (Texas, Florida)\rApril 27 - Independence Day (Sierra Leone and Togo)\rApril 27 - Freedom Day (South Africa)\rApril 27 - World Tapir Day\rApril 27 - King's Day (Netherlands) from 2014, birthday of Willem-Alexander of the Netherlands\rApril 28 - Workers Memorial Day\rApril 28 - National Day (Sardinia)\rApril 28 - National Heroes Day (Barbados)\rApril 29 - Showa Day (Japan), birthday of Emperor Hirohito, who died in 1989\rApril 29 - International Dance Day\rApril 30 - Former Queen's Day Holiday in the Netherlands (changed to King's Day, April 27 in 2014), was the birthday of former Queen Juliana of the Netherlands\rApril 30 - Flag Day in Sweden (birthday of King Carl XVI Gustaf of Sweden)\rApril 30 - International Jazz Day\rApril 30 - Walpurgis Night (Central and Northern Europe)\r\rMoveable Events \rEggs celebrating Easter, which often falls in April, but sometimes falls in March.\rImage traditionally showing it as raining in April in the Northern Hemisphere.\rEaster-related events in Western Christianity:\rPalm Sunday (between March 15 and April 18)\rMaundy Thursday (between March 19 and April 22)\rGood Friday (between March 20 and April 23)\rEaster Sunday (between March 22 and April 25)\rEaster Monday (between March 23 and April 26)\rEastern Orthodox Easter falls between April 4 and May 8.\rAscension Day (Western Christianity), falls between April 30 and June 3.\rJewish Passover - falls in the same week as Western Christianity's Holy Week, which is the week leading up to Easter.\rMother's Day (UK) falls between March 1 and April 4.\rWorld Snooker Championship (late April, early May)\rHorse racing - Grand National (UK), Kentucky Derby (United States)\rStart of Daylight Saving Time - Clocks going forward one hour:\rMost of Mexico\rMorocco (Ramadan does not include Daylight Saving Time)\rEnd of Daylight Saving Time - Clocks going back one hour:\rSoutheast Australia, and New Zealand\rChile\rMarathon Events in the following cities:\rBelgrade, Serbia\rBoston, Massachusetts, United States\rBrighton, United Kingdom\rEnschede, Netherlands\rLondon, United Kingdom\rMadrid, Spain\rParis, France\rRotterdam, Netherlands\rUtrecht, Netherlands\rZurich, Switzerland\r\rSelection of Historical Events \rInauguration celebration for Nunavut on April 1, 1999.\rA statue on Easter Island - Jacob Roggeveen became the first European to land there on April 5, 1722.\rNewspaper report on the sinking of the RMS Titanic on April 15, 1912.\rFires after the San Francisco earthquake on April 18, 1906.\rAustralian and New Zealand forces landing at Anzac Cove, April 25, 1915.\rPainting showing the Mutiny on the Bounty on April 28, 1789.\rQueen Juliana of the Netherlands, who abdicated the throne on her 71st birthday, April 30, 1980.\rApril 1, 1918 - The Royal Air Force is founded.\rApril 1, 1976 - Apple Inc. is founded.\rApril 1, 1979 - The Islamic Republic of Iran is founded.\rApril 1, 1999 - The territory of Nunavut is created in Northern Canada.\rApril 1, 2001 - The Netherlands introduces same-sex marriage, as the first country to do so.\rApril 2, 1519 - Florida is sighted by a European for the first time.\rApril 2, 1930 - Haile Selassie becomes Emperor of Ethiopia.\rApril 2, 1982 - Start of the Falklands War, as Argentine forces land on the Falkland Islands.\rApril 2, 2005 - Pope John Paul II dies aged 84, after 26-and-a-half years as Pope.\rApril 3, 1973 - The first-ever mobile phone call is placed by Martin Cooper in New York City.\rApril 4, 1721 - Robert Walpole becomes the first Prime Minister of Great Britain.\rApril 4, 1841 - William Henry Harrison dies. He was President of the United States for 31 days, the shortest-ever time in office for a US President.\rApril 4, 1960 - Senegal becomes independent.\rApril 4, 1968 - Assassination of Martin Luther King, Jr. in Memphis, Tennessee.\rApril 5, 1722 - Jacob Roggeveen becomes the first European to land on Easter Island, landing there on Easter Sunday.\rApril 6, 1320 - Scotland's independence is confirmed with the Declaration of Arbroath.\rApril 6, 1830 - The Mormon Church is founded.\rApril 6, 1909 - Robert Peary claims to have been first at the North Pole on this date.\rApril 7, 1994 - The Rwandan Genocide begins.\rApril 9, 1865 - American Civil War: Confederate forces under Robert E. Lee surrender to Union forces.\rApril 9, 1940 - World War II: Denmark and Norway are invaded by Nazi Germany.\rApril 9, 1989 - April 9 tragedy: In Tbilisi, Georgia, a peaceful demonstration for independence is broken up by the Soviet Army, killing 20 people. The country gains independence on this date exactly two years later.\rApril 10, 1815 - Mount Tambora in Indonesia erupts in a huge eruption, affecting the world's climate for at least a year.\rApril 10, 2010 - A plane crash near Smolensk, Russia, kills several people who were important in Poland, including President Lech Kaczynski.\rApril 11, 1814 - Napoleon Bonaparte is exiled to the island of Elba.\rApril 11, 1954 - Said to have been the most boring day of the 20th century.\rApril 12, 1861 - The American Civil War begins at Fort Sumter, Charleston, South Carolina.\rApril 12, 1945 - US President Franklin D. Roosevelt dies, and Harry S. Truman replaces him.\rApril 12, 1961 - Yuri Gagarin becomes the first human to fly into space.\rApril 14, 1865 - US President Abraham Lincoln is shot dead at Ford's Theatre by John Wilkes Booth. Lincoln dies the next day.\rApril 14, 2010 - Qinghai Province, China, is hit by an earthquake, killing tens of thousands of people.\rApril 14, 2010 - The eruption of Eyjafjallajokull in Iceland shuts down air traffic around Europe for a week, due to its ash cloud.\rApril 15, 1912 - The ship RMS Titanic sinks near Newfoundland after hitting an iceberg, resulting in the deaths of many of the people on board.\rApril 16, 1943 - Albert Hofmann discovers LSD's effects.\rApril 17, 1946 - Syria gains full independence from France.\rApril 18, 1906 - 1906 San Francisco earthquake: San Francisco, California, is hit by a big earthquake, resulting in fires that destroy large parts of the city.\rApril 18, 1980 - Zimbabwe gains full independence.\rApril 19, 1897 - The first Boston Marathon is held.\rApril 19, 1971 - Sierra Leone becomes a republic.\rApril 19, 1993 - The siege of the Branch Davidians at Waco, Texas, ends in a fire that kills 82 people.\rApril 19, 1995 - Timothy McVeigh carries out the Oklahoma City bombing, killing 169 people.\rApril 19, 2005 - Joseph Alois Ratzinger becomes Pope Benedict XVI.\rApril 20, 1902 - Marie Curie and Pierre Curie refine Radium.\rApril 20, 2010 - Deepwater Horizon oil spill: A massive fire on the Deepwater Horizon drilling rig in the Gulf of Mexico kills 11 workers and causes a massive oil spill, the worst spill in US history.\rApril 21, 753 BC - Legendary founding date of Rome\rApril 21, 1509 - Henry VIII of England becomes King.\rApril 21, 1908 - Frederick Cook claims to have reached the North Pole on this date.\rApril 22, 1502 - Pedro Alvares Cabral becomes the first European to reach present-day Brazil.\rApril 22, 1970 - Earth Day is observed for the first time.\rApril 23, 1533 - The Church of England declares that Henry VIII of England and Catherine of Aragon are not married.\rApril 24, 1916 - The Easter Rising occurs in Dublin, Ireland.\rApril 24, 1990 - The Hubble Space Telescope is launched on the Space Shuttle Discovery.\rApril 25, 1915 - World War I: In Turkey, the Battle of Gallipoli begins, Australian, French, British and New Zealand forces land at Anzac cove.\rApril 25, 1974 - Portugal's dictatorship is overthrown in a coup, in what is known as the Carnation Revolution.\rApril 26, 1937 - Spanish Civil War: German planes bomb the town of Guernica, Basque Country, later depicted in a painting by Pablo Picasso.\rApril 26, 1964 - Tanganyika and Zanzibar merge to form Tanzania.\rApril 26, 1986 - A reactor explosion occurs at the Chernobyl nuclear plant in present-day Ukraine, with radiation spreading around Europe and the world.\rApril 26/27, 1994 - South Africa holds its first free elections.\rApril 27, 1960 - Togo becomes independent from France.\rApril 27, 1961 - Sierra Leone becomes independent from the United Kingdom.\rApril 28, 1789 - Mutiny on the ship Bounty in the Pacific Ocean, lead by Fletcher Christian.\rApril 28, 1945 - Benito Mussolini is executed by Italian partisans.\rApril 28, 1947 - In Peru, Thor Heyerdahl starts his Kon-Tiki expedition aimed at proving his theory that the Polynesian settlers on the Pacific Ocean's islands came from South America.\rApril 29, 1991 - A cyclone in Bangladesh kills an estimated 138,000 people.\rApril 29, 2011 - The wedding of Prince William, Duke of Cambridge and Catherine, Duchess of Cambridge is broadcast worldwide.\rApril 30, 1789 - George Washington becomes the first President of the United States.\rApril 30, 1803 - The United States purchases (buys) the Louisiana territory from France.\rApril 30, 1945 - Adolf Hitler commits suicide on the same day that the Soviet Army raises the Red Flag on Berlin's Reichstag.\rApril 30, 1952 - The Diary of Anne Frank is published in English.\rApril 30, 1975 - The Vietnam War ends, as North Vietnamese forces take Saigon.\rApril 30, 1980 - Queen Juliana of the Netherlands abdicates the throne, and her daughter becomes Queen Beatrix of the Netherlands. Beatrix later also abdicates, on this day in 2013, in favor of her son, King Willem-Alexander of the Netherlands.\rTrivia \rElizabeth II is one of six current European monarchs to have been born in April.\rIn Western Christianity, there is a bigger likelihood of Easter falling in April than in March.\rThe months around April (March and May) both start with an 'M' in the English language, with an 'A' as the second letter.\rIn the English language, April is the first of three months in-a-row, along with May and June, that is also a female given name.\rThe astrological signs for April are Aries (March 21 to April 20) and Taurus (April 21 to May 20).\rThe sweet pea and daisy are the traditional birth flowers for April.\rBirthstone for April is the Diamond.\rApril 1 is the only day in April to start within the first quarter of the calendar year.\rIf the months of the year were arranged in alphabetical order in the English language, April would come first.\rSix current European monarchs were born in April. They are King Philippe of Belgium (April 15), Queen Margrethe II of Denmark (April 16), Henri, Grand Duke of Luxembourg (April 16), Elizabeth II of the United Kingdom and Commonwealth realms (April 21), King Willem-Alexander of the Netherlands (April 27), and King Carl XVI Gustaf of Sweden (April 30).\rReferences \r",
                "docDate": 1603516465000,
                "domain": "s.wikipedia.org",
                "title": "April ",
                "url": "http://s.wikipedia.org/wiki/April",
                "_id": "0",
                "_highlights": {
                    "content": "April 12, 1945 - US President Franklin D. Roosevelt dies, and Harry S. Truman replaces him. April 12, 1961 - Yuri Gagarin becomes the first human to fly into space."
                },
                "_score": 0.6268274
            },
            {
                "content": "A church in Ethiopia\rA church is a building that was constructed to allow people to meet to worship together. These people are usually Christians, or influenced by Christianity. Some other religious groups also call their religious buildings churches.Introduction to New and Alternative Religions in America: 2006 - Page 252An Introduction to the Unitarian and Universalist Traditions - Page 128, 2011\r\rDepending on the number of people that are in a community, the churches come in different sizes. Small churches are called chapels. The churches in a particular geographical area form a group called the diocese. Each diocese has a cathedral. In most cases, the cathedral is a very big church. Cathedrals are the seat of bishops.\r\rHistory of church buildings \r\rAn old English church showing Saxon architecture (rounded end)\rAberlady Church near Edinburgh, Scotland\rSmall church in Ohio\rLindenberg Church, near Berlin, Germany is a 13th century church.\rInside the transept of the Cathedral of Évora, Portugal \rSpeyer Cathedral, the largest Romanesque building still in existence.\rLa Madeleine, Paris is one of the main sights in Paris, France\r\rIn the early days of Christianity people had to worship in secret. Christian worship was not allowed in the Roman empire, so Christians had to meet in a secret place. Sometimes they met in people’s houses or barns, sometimes they met underground. The first places that were built for Christian worship were small chapels that were cut into a rock where people could worship without being discovered.\r\rAfter the death of the Roman emperor Constantine in 337 A.D. Christians were allowed to have buildings to worship in. These first churches were built on a similar plan to Roman basilicas. This plan was later used for the fine Gothic cathedrals and churches that were built at the end of the Middle Ages.\r\rThe parts of a church \rThere are several parts in the architecture of a church. Not all churches will have all these parts:\r\rThe nave is the main part of the church where the congregation (the people who come to worship) sit. \rThe aisles are the sides of the church which may run along the side of the nave.\rThe transept, if there is one, is an area which crosses the nave near the top of the church. This makes the church shaped like a cross, which is a symbol of Jesus's death on a cross.\rThe chancel leads up to the altar at the top of the church. The altar is in the sanctuary. The word “sanctuary” means “sacred place”. People were not allowed to be arrested in the sanctuary, so they were safe. The altar is usually at the east end of the church. People in the church sit facing the altar. We say that the church “faces east”.\rChurches will also have a tower or steeple, usually at the west end. If the church has a transept the tower may be above the centre of the transept.\r\rIn Roman Catholic churches there is always a stoup (bowl) of holy water near the entrance of the church. This tradition comes from the fact that Roman basilicas had a fountain for washing in front of the entrance. The font is a bowl where people (often babies) are baptized. This is also near the entrance of the church. This is a symbol of the fact that it is welcoming the people into the Christian church.\r\rTraditionally the nave has long benches for the congregation to sit on. These are called pews. Some churches may now have replaced their pews with chairs so that they can be moved about for different occasions. At the front of the nave is the pulpit where the priest preaches (these talks are called “sermons”). There is also a lectern (like a large music stand) from where the lessons (the Bible readings) are read.\r\rIf there are aisles along the side of the nave there will be pillars which hold up the roof. In large churches or cathedrals there may be a row of little arches along the top of these pillars. This is called the triforium. Over the triforium is the clerestory which is a row of windows high up in the church wall.\r\rThe chancel is the most holy part of the church, and this is why it is often separated from the nave by a screen which can be made of wood or stone, or occasionally iron. The congregation can see through the screen. On the top of the screen there may be a cross. This is called a rood (pronounce like “rude”) screen. Priests used to climb up a staircase to the top of the rood screen to read the epistle and the gospel. Sometimes people sang from there.\r\rInside the chancel are the benches where the choir sit. These are called choir stalls. They are on both sides. The two sides of the choir sit facing one another. The choir members who sit on the left (north side) are called “cantoris” (the side where the “cantor” sits) and those on the right (south side) are called “decani” (the side where the deacon sits). In some large churches or cathedrals the seats for the priests tip up. The top of these seats, when they are tipped up, are called misericords (from the Latin word for “mercy”). This is because the priests or monks were able to lean against them when they got tired if they had to stand up for a long time.\r\rSometimes there are holes in the walls of the screen so that the congregation can see through. These are called squints. If there is a recess in the wall it is called an aumbry. It is a cupboard for communion wine and bread that have been consecrated by a priest.\r\rThe altar may be right at the east end of the church, but in larger churches or cathedrals it is often much farther forward. In that case the very east end is called an apse. Sometimes it is a separate chapel called the “Lady Chapel”.\r\rChurches through the ages \r\rThe design of churches changed a lot during the course of history. Often churches were made bigger. When this happened there may be a mixture of architectural styles. These styles vary a lot in different countries.\r\rEnglish churches \r\rIn English churches there were several different periods of architecture:\r\rThe Saxon period (700–1050) was a time when churches were very simple. The end of the church (end of the sanctuary) was often rounded. Hardly any are left now because they were mostly made of wood.\rThe Norman period (1050–1190) came from the style called Romanesque which was popular in Europe. The arches had ornaments which were called “mouldings”. The tops of the pillars looked like cushions, so they were called “cushion capitals”. The windows were narrow and rounded at the top.\rEarly English or Gothic architecture (1190–1280) was not as solid and heavy as Norman architecture. Towers were elegant and tall, like the tower of Salisbury Cathedral.\rThe Decorated style of architecture (1280–1360)was popular at a time when the plague (Black Death) was raging and a third of the people in England died. For that reason, not so much building was done then. There were lots of stone carvings were made in churches at that time.\rThe Perpendicular style (1360–1540) was very grand. It had lots of straight upward lines and fan vaulting. This can be seen in Westminster Abbey and King's College Chapel, Cambridge. Many churches that can be seen in England were built in this period.\r\rIn the 1600s, churches were built in a variety of styles. Often they copied some of the older styles. After the Great Fire of London many new churches were built by the architect Sir Christopher Wren. They were built in the classical style. Churches continued to be built in later centuries like this, but also the Gothic style continued to be used.\r\rModern churches often do not have the traditional cross-shape. It is difficult for the congregation to see and hear what is happening in the chancel. Modern churches bring the congregation, choir and priests in closer touch. An example is the round design for the Church of Christ the Cornerstone in Milton Keynes. Modern churches are often simpler but with a warmer character than the Gothic churches. Many have beautiful mosaic glass windows. Coventry Cathedral is a famous example of a modern church building.\r\rRelated pages\rCathedral\rChapel\rChoir (music)\r\rReferences \r\rEncyclopædia Britannica, 1973 \r\rOther websites \r\r[http://www.ortodoksi.net/virtuaalikirkko/index.html Virtual Church] \r\r",
                "docDate": 1611230605000,
                "domain": "s.wikipedia.org",
                "title": "Church (building) ",
                "url": "http://s.wikipedia.org/wiki/Church_(building)",
                "_id": "74",
                "_highlights": {
                    "content": "These are called choir stalls. They are on both sides."
                },
                "_score": 0.6265337
            },
            {
                "content": "Cuba is an island country in the Caribbean Sea. The country is made up of the big island of Cuba, the Isla de la Juventud island (Isle of Youth), and many smaller islands. Havana is the capital of Cuba. It is the largest city. The second largest city is Santiago de Cuba. In Spanish, the capital is called \"La Habana\". Cuba is near the United States, Mexico, Haiti, Jamaica and the Bahamas. People from Cuba are called Cubans (cubanos in Spanish). The official language is Spanish. Cuba is warm all year.\r\rIn 1492, Christopher Columbus landed on the island of Cuba. He claimed it for the Kingdom of Spain. Cuba became a Spanish colony until the Spanish–American War of 1898. After the war, it was part of the United States. It gained independence in 1902.\r\rIn 1959, guerrilla fighters led by Fidel Castro and Che Guevara overthrew Cuba's dictator, Fulgencio Batista, in what became the Cuban Revolution. Castro began making relations with the Soviet Union and tried to close a lot of American businesses in Cuba; the United States did not like this. In 1961 Castro officially announced that his government was socialist. The US attempted to invade Cuba to regain control of it and overthrow it's communist led government but failed. The Communist Party of Cuba was created in 1965 and has ruled the island ever since. Today, Cuba is the only communist state outside of Asia, in the Caribbean, and in the western hemisphere.\r\rCulture \rCuba is famous for many types of music, especially dance music such as the Salsa and Mambo. Because Cubans have ancestors from Spain, Africa, South America and North America, Cuban music is special and different.\r\rReading is very popular in Cuba. Many people especially enjoy reading books or things that come from outside the country, even though the government does not approve of this. They also love music and sports. Cuban music is very lively. This is because a lot of it comes from African and Spanish rhythms. Baseball, basketball, and athletics events are loved by many Cuban people. The Cheifs football-team took at one Football-World-Cup part. In 1938, they reached the quarter-final and lost against Sweden 0:8.\r\rHistory \r\rFile:Darlington map of Cuba 1680.png - A map of Cuba made in 1680\rFile:Black Cubans in Havana, late 19th century.jpg - Black Cubans in Havana during the 1800s\rFile:Knackstedt & Näther Stereoskopie 0669 Cuba. Zuckerrohr-Plantage. Bildseite mit Ansicht um 1900 arbeitender Sklaven im Feld auf Kuba (cropped).jpg - Slaves forced to grow sugar cane on a Cuban plantation\rFile:Raúl, Vilma, Jorge Risquet y José Nivaldo Causse.jpg - Cuban revolutionaries in 1958\rEarly history \rBefore Cuba was conquered by the Spaniards, three tribes lived on the island. They were the Taínos, the Ciboneys, and the Guanajatabeyes. The Taínos were the largest and most common of the three tribes. They farmed crops such as beans, corn, squash, and yams. The Taínos also slept in hammocks which the Spaniards would introduce to the rest of the world. Then, in 1492, Christopher Columbus arrived in Cuba on his first trip to the Americas. Three years later he claimed the islands for the Spanish. The Spanish began to rule Cuba afterwards. The Spanish brought thousands of slaves from Africa to Cuba to work for them. Most of the native Cubans died because of the new diseases brought by the Spanish and Africans. The Spanish also treated the native Cubans very cruelly and massacred many of them.\r\rThe Spanish ruled for many years. Cuba became the most important producer of sugar. In the early 1800s, Cubans rebelled against the Spanish rulers, but failed until 1898, when the United States went to war with the Spanish and defeated them. Cuba became American for four years afterwards, before it became an independent republic in 1902. Even though Cuba was independent, the Americans still controlled the island by a law called the Platt Amendment. In 1933 the Cubans stopped the Platt Amendment, but the Americans still had a big say in Cuban politics. Americans owned most of Cuba’s businesses. The Americans supported the leader Fulgencio Batista, who was seen by many Cubans as corrupt.\r\rIn addition to political control, the United States also exercised significant control over the Cuban economy. At the time, Cuba was a monoculture economy. While they produced coffee, tobacco, and rice, they relied primarily on sugar. Thus, they were known by other countries as the \"sugar bowl of the world.\" The United States bought sugar from the Republic of Cuba at a price higher than the global standard. In exchange, Cuba was to give preference to the United States, and its industries. Cuba depended on the United States and their investments. Cuba was not industrialized and needed the revenue for goods and oil. They also needed the US investment for gas, electricity, communications, railways, and banks. While Cuban workers had better conditions than other countries in the continent, they still faced inequality, lack of infrastructure, high illiteracy rates, and a lack of full-time work (the sugar industry was seasonal).\r\rCuban Revolution \rIn 1959, Fidel Castro led a revolution against Fulgencio Batista. Castro took power in Cuba with Che Guevara from Argentina, his brother Raul, and others who fought against Batista. Castro made many changes to Cuba. He ended American ownership of Cuban businesses. This made Castro unpopular in America and the United States banned all contact with Cuba. Many Cubans went to America because of this. In 1961, the Americans helped some of these Cubans to attack Cuba and try to remove Castro, but they failed. Castro then asked the Soviet Union to help defend them from the Americans, which they did. The Soviet Union put nuclear weapons in Cuba and aimed them at the United States. American President Kennedy demanded that they be removed or a new war would begin. This was known as the Cuban Missile Crisis. The Soviet Union removed the missiles when the United States agreed to not continue attacking Cuba and to remove missiles from Turkey.\r\rCuba became a communist-led country like the Soviet Union after this. The Soviet Union bought most of Cuba’s sugar for expensive prices. Cuba spent this money on health, education and the army. This made Cuba’s schools and hospitals some of the best in the world. The army fought in Africa to support black Africans against the white South African army. Cuba also supported groups in South America fighting against the dictators of those countries.\r\rHowever, the Cuban government began to control most of life in Cuba under the communist system. Disagreeing with the Cuban government and Fidel Castro in public was not allowed. Some Cubans did not like this and tried to leave Cuba. Most Cubans who left went to the United States. Some Cubans who did not like the government and stayed were put in jail. Many groups from around the world protested against Cuba because of this, and demanded that Fidel Castro give up power.\r\rIn 1991, the Soviet Union collapsed. This meant that Cuba, which had sold most of its products to the Soviet Union, had no money coming into the country. The Americans made the restrictions against contact with Cuba tighter. America said the restrictions on contact would continue unless Fidel Castro gave up power. Cuba became very poor in the 1990s. This became known in Cuba as “The Special Period”. Because of the disaster, Cuba changed to allow less control by the government, more discussion amongst the people, and private shops and businesses. Cuba also tried to get tourists to visit the island.\r\rIn the 2000s, tourism to Cuba began to make money for the island again. Though Fidel Castro had remained in power, he had passed all duties to his brother Raul after an illness. Fidel Castro was one of the longest-serving heads of state. In 2018, Miguel Díaz-Canel became the official President of Cuba.\r\rIn April 2015, historic talks took place with US President Obama and Cuban General Secretary Raúl Castro in improving relations between the two nations.\r\rThe trade embargo issued by President Kennedy in the 1960s has been considerably loosened under Obama's administration. US citizens can now travel directly to Cuba at certain times of the year. Before, Americans had to go via Mexico if they wanted to go to Cuba. Americans are still not allowed to purchase or smoke Cuban cigars. The cigars are smuggled over the US-Canadian border since they are legal in Canada.\r\rFor military service, men from the age of 17 to 28 years old must go into the army for two years. It is optional for women.\r\rAdministrative divisions\rThe country is divided into 15 provinces and one special municipality (Isla de la Juventud). The provinces are divided into municipalities.\r\rProvinces of Cuba\rDemographics \rThe population of Cuba is close to 13 million. The people of Cuba come from three different groups. The largest group is the descendants of the Spanish settlers who came to Cuba. The smallest group is the descendants of the black African slaves who were brought in to do the work and birth children (in the barracoon) as New World slaves who could be legally sold into life time bondage in the United States. The middle-sized group is a mix of African and Spanish. The government succeeded in seeing that the three different groups were treated the same. According to a DNA Caribbean Studies Institute, the racial-makeup of the population of Cuba is:\rEuropean Cubans descend from settlers that came during the very late 15th century and onward. Most white Cubans came from many different parts of Spain, but the most numerous were the Canary Islanders, Andalusians, and Catalans. There was as well some French, Italian and English peoples. Whites makeup approximately 30% of Cuba's population as of 2012, and they mostly populate the western part of Cuba, specially cities like Havana and Pinar del Rio. These brought with them their language, religions, music and others.\rAfricans and Mulatto Cubans descend from the arrival of African slaves that came from various parts of Africa but the most numerous were West Africans. There were also more than 500,000 Haitians that came to Cuba during the Haitian Revolution days. Most Cuban slaves tended to come from the Kongo and Yoruba tribes, there were also the Igbos, Ewes, Fons, Fulas, Mandinkas and some others. Afro-Cubans range enormously from 33.9 percent to 70 percent of the population, and they are mostly concentrated in the east parts of Cuba. These brought with them their instruments, reigion (Santeria), and customs to the Cuban culture.\rMediterranean Cubans are about 3% of the population, however; one must know that a lot of the Southern Spaniard Cuban descendants have good portion of Moor blood in their family lines; due to the close proximate Spain is to North Africa. Many Mediterranean Cubans came during the 1820s-1880s and sometimes onward. These are most concentrated in the East specially cities like Guantanamo Bay. They brought much of their foods and cuisines to Cuba and a few vocabularies.\r\rHealth and education \rCuba is a developing country, and is often depicted as a very poor country. In some aspects, however, like education, health care and life expectancy it ranks much better than most countries in Latin America.[http://www.hsph.harvard.edu/review/review_summer_02/txt677cuba.html Harvard Public Health Review/Summer 2002] The Cuban Paradox Its infant death rate is lower than some developed countries. The average life expectancy is 78 years.\r\rAll the children are required to go to school from six to twelve years old, and nearly everybody is able to read and write at least. There is free education at every level. Because of this, Cuba has a 99.8% literacy rate.\r\rIn 2006, the World Food Programme certified Cuba to be the only country in this region without undernourished children. In the same year, the United Nations said that Cuba was the only nation in the world that met the World Wide Fund for Nature's definition of sustainable development.\r\rGeography \r\rA tobacco field in Pinar del Río.\rCuba is the largest island in the West Indies. It has many resources. Only about one-fourth of the land is mountains or hills. Much of the land is gentle hills or plains which are good for farming or raising cattle. Cuba has fertile soil and a mostly warm and humidodity climate that makes it a great place for growing crops.\r\rSugar is the most important crop of Cuba, and they may get it from the sugar cane. Sugar cane is the largest cash crop grown in Cuba, and it brings in most of the money. After that, the second is tobacco. Tobacco is made into cigars by hand. A hand-made cigar is considered by many people to be the finest in the world. Other important crops are rice, coffee, and fruit. Cuba also has many minerals. Cobalt, nickel, iron, copper, and manganese are all on the island. Salt, petroleum, and natural gas are there too. The coast of Cuba has many bays and a few good harbors. Havana, which is the capital, is also a port. Other harbors have port cities. Nuevitas is a port city on the north coast. Cienfuegos, Guantánamo, and Santiago de Cubaare some of the port cities on the south coast.\r\rCuba has a semi-tropical climate. That means that the cool ocean winds keep it becoming hot, despite its being in the tropiocal zone. Cuba has a wet season and a dry season. The dry season is from November to April, and the wet season is from May to October. August to October is also the hurricane season in the Atlantic Ocean. Because of this, most of Cuba's port cities can be flooded along the coast.\r\rRelated pages \rCuba at the Olympics\rCuba national football team\rList of rivers of Cuba\r:Category:Cuban people\r\rReferences \r\r\rCategory:Spanish-speaking countries",
                "docDate": 1621452611000,
                "domain": "s.wikipedia.org",
                "title": "Cuba ",
                "url": "http://s.wikipedia.org/wiki/Cuba",
                "_id": "96",
                "_highlights": {
                    "title": "Cuba"
                },
                "_score": 0.6260247
            },
            {
                "content": "The cathars are expelled from Carcassonne, in the year 1209\rThe lower, older part of Castle Peyrepertuse. This castle was one of the last Cathar strongholds to fall\r\rThe Cathar faith was a version of Christianity. They were usually considered Gnostics. The word 'Cathar' comes the Greek word katharos meaning 'unpolluted' (from Tobias Churton, The Gnostics) or \"the pure ones\".\r\rPrinciples \rThe Cathars believed that the world had been made by a bad god. They believed that this bad god had taken them from the good god and put them in the world, but inside their bodies there was a spirit, and that spirit needed to return to the good god. They were famous for a belief in a form of reincarnation and believed that when someone died the bad god would put that person's spirit in a new body. They believed this cycle of coming back to life could be escaped by a ritual cleansing. They were opposed to the doctrine of sin. \r\rWomen were prominent in the faith. They were pacifists. They didn't eat anything that was made from other animals, including meat and cows milk. The only exception to this was fish. Fish was OK to eat because they believed fishes were not alive but just things that were sometimes produced from dirt and water.\r\rThey preached tolerance of other faiths. They rejected the usual Christian rules of marriage and only believed in the New Testament. An earlier 10th-century Bulgarian heresy, Bogomilism and also Manichaeism started some of these trends. \r\rLanguage \rThey used a bible in the language people spoke. Many other Christians used a Bible in Latin. Latin was spoken only by the priests.\r\rProblems \rIn 1145, open challenge to Catholic dominance began. In about 1165, the first Cathars said that the Church was \"full of ravening (starving) wolves and hypocrites\" and \"worshipping the wrong God\", right in front of the most powerful Catholics. In 1166, the Council of Oxford in England wiped out the English Cathars. It was also suppressed in Northern France. In 1167, Cathar bishops met to discuss organizing a counter Church - in the South of France, the Languedoc nobles protected it, and many noble women became \"Perfects\". Parish clergy had low morale, or confidence.\r\rReactions \rThe Catholic Church was against Catharism, seeing it as a heresy.\r\rIn the South of France there was tremendous religious fervor, and an economy that was starting to grow, and a social class of merchants and peasants was starting to grow. Peasants owned their own land. Meanwhile, in other parts of Europe, peasants were forced to give up their land to nobles and become serfs or slaves - the system of feudalism. There was a strong central absolute monarchy that did not exist in the South of France. The burghers and bankers had more power in this looser system. R. I. Moore is a historian who believes that it was desire to crush this system and take over the land that drove the attack.\r\rHowever, there was real cultural and religious difference to cause problems: Troubadors, who combined some of the traditions of the Bards of the Celts, and Jews, were both part of the multicultural society in the South of France. Their influences were not appreciated by local or Roman Church figures. The 12th century Roman Catholic Monks were founding their monasteries outside the towns, drawing the best people there.\r\rResults \rThe Cathars thus had little competition. The Cathar \"Perfects\", the so-called Good Men or Good Women, lived restrained lives and spread their faith in towns - where the Catholics in general did not have their best agents. Also, Cathars preached that only these Good leaders had to follow the regimens their whole lives - lay people could repent only on their deathbeds. Many 20th century Christian sects have similar beliefs.\r\rThe Albigensian Crusade \rBattle of Muret, 1213\r\rMethods \rThe Pope ordered a crusade against the Cathars in southern France. He said any crusader who answered the call would be given the same rewards as a crusader who went to the Holy Land. This was an absolution of all sin.\r\rIn the Launguedoc, on the 22nd of July 1209, a force of about 30,000 Crusaders arrived at the walls of Beziers bearing the cross pattee to mislead and create ease among the Cathars, thinking they were friend, not foe, and demanded that about 200 Cathars be surrendered. The people of the town who were mostly Catholic, said that rather than turn over their friends and family, \"we would rather be flayed alive.\" \r\rA mistake by the defenders of Beziers let thousands of attackers in. Arnauld Amaury made the famous quote \"Kill them all, god knows his own\" on being asked how to tell who were Cathars during the assault. Everyone in the town was killed, some while taking refuge in the church. It is guessed that 20,000 were killed, many of whom were Catholics and not Cathars at all. The crusade became known as the Albigensian crusade after the town of Albi. It was to wipe out the Cathars almost entirely over forty or so years. The Crusaders wanted to go home, but were ordered by the Pope to continue until the whole South of France was controlled and all Cathars were dead. In 1210, they attacked the fortress at Minerv and built \"the first great bonfire of heretics\" - beginning the practice of burning at the stake that would continue in the Inquisition of the Counter-Reformation. It is interesting to note that at the siege of Montsegur when the fires were lit the Cathars ran down the hill and threw themselves on, as their beliefs were very strong.\r\rResult\rCatharism disappeared from the northern Italian cities after the 1260s, pressured by the Inquisition. The last known Cathar perfectus in the Languedoc, Guillaume Bélibaste, was killed in 1321.\r\rOther websites \rhttp://dannyreviews.com/h/Cathars.html\rhttp://gnosistraditions.faithweb.com/mont.html\rhttp://www.fordham.edu/halsall/source/gui-cathars.html\rhttp://philtar.ucsm.ac.uk/encyclopedia/christ/west/cathar.html \rhttp://pages.britishlibrary.net/forrester-roberts/cathars.html \r[http://cathars.philosophi.org Cathar Center in Barcelona: Books, spirituality, exhibition] \r\rCategory:Gnosticism\rCategory:Nontrinitarianism\rCategory:Christianity of the Middle Ages",
                "docDate": 1610898348000,
                "domain": "s.wikipedia.org",
                "title": "Catharism ",
                "url": "http://s.wikipedia.org/wiki/Catharism",
                "_id": "72",
                "_highlights": {
                    "content": "They were pacifists. They didn't eat anything that was made from other animals, including meat and cows milk."
                },
                "_score": 0.62411946
            },
            {
                "content": "alt=\rThe Milky Way as viewed from La Silla Observatory\r\rAstronomy (from the Greek astron (ἄστρον) meaning \"star\" and nomos (nόμος) meaning \"law\") is the scientific study of celestial bodies such as stars, planets, comets, and galaxies. The imaginary patterns in the night sky are called constellations.\r\rThe objects studied include stars, galaxies, planets, moons, asteroids, comets and nebulae. Phenomena outside the Earth's atmosphere are also studied. That includes supernovae explosions, gamma ray bursts, and cosmic microwave background radiation. Astronomy concerns the development, physics, chemistry, meteorology and movement of celestial bodies, as well as the structure and development of the Universe.\r\rAstronomy is one of the oldest sciences. Ancient Greek people used the positions of the stars to navigate, and to find when was the best time to plant crops. Astronomy is very similar to astrophysics. A related subject, cosmology, is concerned with studying the Universe as a whole, and the way the universe changed over time. Astronomy is not the same as astrology, the belief that motion of the stars and the planets may affect human lives.\r\rSince the 20th century there have been two main types of astronomy, observational and theoretical astronomy. Observational astronomy uses telescopes and cameras to observe or look at stars, galaxies and other astronomical objects. Theoretical astronomy uses maths and computer models to explain the observations and predict what might happen. Working together, theories predict what should happen and observations show whether the predictions work. The main work of astronomy is to explain puzzling features of the universe. For thousands of years the most important issue was the motions of planets; now many other topics are studied.\r\rHistory of astronomy \r\rAncient \rEarly astronomers used only their eyes to look at the stars. They made maps of the constellations and stars for religious reasons and calendars to work out the time of year. Early civilisations such as the Maya people and the Ancient Egyptians built simple observatories and drew maps of the stars positions. They also began to think about the place of Earth in the universe. For a long time people thought Earth was the center of the universe, and that the planets, the stars and the sun went around it. This is known as geocentrism.\r\rAncient Greeks tried to explain the motions of the sun and stars by taking measurements.Neugebauer, Otto E. 1975. A history of ancient mathematical astronomy. Berlin: Springer. A mathematician named Eratosthenes was the first who measured the size of the Earth and proved that the Earth is a sphere. A theory by another mathematician named Aristarchus was, that the sun is in the center and the Earth is moving around it. This is known as heliocentrism. Only a few people thought it was right. The rest continued to believe in the geocentric model. Most of the names of constellations and stars come from Greeks of that time.Thurston H. 1994 Early astronomy. Springer, p2.\r\rArabic astronomers made many advancements during the Middle Ages including improved star maps and ways to estimate the size of the Earth. They also learned from the ancients by translating Greek books into Arabic.\r\rRenaissance to modern era \rDrawings of the Moon by Galileo. His drawings were more detailed than anyone before him because he used a telescope to look at the Moon.\rDuring the renaissance a priest named Nicolaus Copernicus thought, from looking at the way the planets moved, that the Earth was not the center of everything. Based on previous works, he said that the Earth was a planet and all the planets moved around the sun. This brought back the old idea of heliocentrism. A physicist called Galileo Galilei built his own telescopes, and used them to look more closely at the stars and planets for the first time. He agreed with Copernicus. The Catholic Church decided that Galileo was wrong. He had to spend the rest of his life under house arrest. Heliocentric ideas were soon improved by Johannes Kepler and Isaac Newton who invented the theory of gravity.\r\rAfter Galileo, people made better telescopes and used them to see farther objects such as the planets Uranus and Neptune. They also saw how stars were similar to our Sun, but in a range of colours and sizes. They also saw thousands of other faraway objects such as galaxies and nebulae.\r\rModern era \rThe 20th century after 1920 saw important changes in astronomy.\r\rIn the early 1920s it began to be accepted that the galaxy in which we live, the Milky Way, is not the only galaxy. The existence of other galaxies was settled by Edwin Hubble, who identified the Andromeda nebula as a different galaxy. It was also Hubble who proved that the universe was expanding. There were many other galaxies at large distances and they are receding, moving away from our galaxy. That was completely unexpected.\r\rIn 1931, Karl Jansky discovered radio emission from outside the Earth when trying to isolate a source of noise in radio communications, marking the birth of radio astronomy and the first attempts at using another part of the electromagnetic spectrum to observe the sky. Those parts of the electromagnetic spectrum that the atmosphere did not block were now opened up to astronomy, allowing more discoveries to be made.\r\rThe opening of this new window on the Universe saw the discovery of entirely new things, for example pulsars, which sent regular pulses of radio waves out into space. The waves were first thought to be alien in origin because the pulses were so regular that it implied an artificial source.\r\rThe period after World War 2 saw more observatories where large and accurate telescopes are built and operated at good observing sites, normally by governments. For example, Bernard Lovell began radio astronomy at Jodrell Bank using leftover military radar equipment. By 1957, the site had the largest steerable radio telescope in the world. Similarly, the end of the 1960s saw the start of the building of dedicated observatories at Mauna Kea in Hawaii, a good site for visible and infra-red telescopes thanks to its high altitude and clear skies.\r\rThe next great revolution in astronomy was thanks to the birth of rocketry. This allowed telescopes to be placed in space on satellites.\r\rSpace telescopes gave access, for the first time in history, to the entire electromagnetic spectrum including rays that had been blocked by the atmosphere. The X-rays, gamma rays, ultraviolet light and parts of the infra-red spectrum were all opened to astronomy as observing telescopes were launched. As with other parts of the spectrum, new discoveries were made.\r\rFrom 1970s satellites were launched to be replaced with more accurate and better satellites, causing the sky to be mapped in nearly all parts of the electromagnetic spectrum.\r\rDiscoveries \rDiscoveries broadly come in two types: bodies and phenomena. Bodies are things in the Universe, whether it is a planet like our Earth or a galaxy like our Milky Way. Phenomena are events and happenings in the Universe.\r\rBodies \rFor convenience, this section has been divided by where these astronomical bodies may be found: those found around stars are solar bodies, those inside galaxies are galactic bodies and everything else larger are cosmic bodies.\r\rSolar \rPlanets\rAsteroids\rComets\r\rGalactic \rStars\r\rDiffuse Objects:\rNebulas\rClusters\r\rCompact Stars:\rWhite dwarf stars\rNeutron stars\rBlack holes\r\rCosmic \rGalaxies\rGalaxy clusters\rSuperclusters\r\rPhenomena \rBurst events are those where there is a sudden change in the heavens that disappears quickly. These are called bursts because they are normally associated with large explosions producing a \"burst\" of energy. They include: \rSupernovas\rNovas\r\rPeriodic events are those that happen regularly in a repetitive way. The name periodic comes from period, which is the length of time required for a wave to complete one cycle. Periodic phenomena include: \rPulsars\rVariable stars\r\rNoise phenomena tend to relate to things that happened a long time ago. The signal from these events bounce around the Universe until it seems to come from everywhere and varies little in intensity. In this way, it resembles \"noise\", the background signal that pervades every instrument used for astronomy. The most common example of noise is static seen on analogue televisions. The principal astronomical example is: cosmic background radiation.\r\rMethods \rInstruments \rTelescopes are the main tool of observing. They take all the light in a big area and put in into a small area. This is like making your eyes very big and powerful. Astronomers use telescopes to look at things that are far away and dim. Telescopes make objects look bigger, closer, brighter. \rSpectrometers study the different wavelengths of light. This shows what something is made of. \rMany telescopes are in satellites. They are space observatories. The Earth’s atmosphere blocks some parts of the electromagnetic spectrum, but special telescopes above the atmosphere can detect that radiation.\r\rRadio astronomy uses Radio telescopes. Aperture synthesis combines smaller telescopes to create a phased array, which works like a telescope as big as the distance between the smaller telescopes.\r\rTechniques \rThere are way astronomers can get better pictures of the heavens. Light from a distant source reaches a sensor and gets measured, normally by a human eye or a camera. For very dim sources, there may not be enough light particles coming from the source for it to be seen. One technique that astronomers have for making it visible is using integration (which is like longer exposures in photography).\r\rIntegration \rAstronomical sources do not move much: only the rotation and movement of the Earth causes them to move across the heavens. As light particles reach the camera over time, they hit the same place making it brighter and more visible than the background, until it can be seen.\r\rTelescopes at most observatories (and satellite instruments) can normally track a source as it moves across the heavens, making the star appear still to the telescope and allowing longer exposures. Also, images can be taken on different nights so exposures span hours, days or even months. In the digital era, digitised pictures of the sky can be added together by computer, which overlays the images after correcting for movement.\r\rAdaptive optics \rAdaptive optics means changing the shape of the mirror or lens while looking at something, to see it better.\r\rData analysis \rData analysis is the process of getting more information out of an astronomical observation than by simply looking at it. The observation is first stored as data. This data will then have various techniques used to analyse it.\r\rFourier analysis \rFourier analysis in mathematics can show if an observation (over a length of time) is changing periodically (changes like a wave). If so, it can extract the frequencies and the type of wave pattern, and find many things including new planets.\r\rSubfields of astronomy\rPulsars pulse regularly in radio waves. These turned out to be similar to some (but not all) of a type of bright source in X-rays called a Low-mass X-ray binary. It turned out that all pulsars and some LMXBs are neutron stars and that the differences were due to the environment in which the neutron star was found. Those LMXBs that were not neutron stars turned out to be black holes.\r\rThis section attempts to provide an overview of the important fields of astronomy. \r\rSolar astronomy \rSolar astronomy is the study of the Sun. The Sun is the closest star to Earth at around 92 million (92,000,000) miles away. It is the easiest to observe in detail. Observing the Sun can help us understand how other stars work and are formed. Changes in the Sun can affect the weather and climate on Earth. A stream of charged particles called the Solar wind is constantly sent off from the Sun. The Solar Wind hitting the Earth's magnetic field causes the northern lights. Studying the Sun helped people understand how nuclear fusion works.\r\rPlanetary astronomy \rPlanetary Astronomy is the study of planets, moons, dwarf planets, comets and asteroids as well as other small objects that orbit stars. The planets of our own Solar System have been studied in depth by many visiting spacecraft such as Cassini-Huygens (Saturn) and the Voyager 1 and 2.\r\rGalactic astronomy \rGalactic astronomy is the study of distant galaxies. Studying distant galaxies is the best way of learning about our own galaxy, as the gases and stars in our own galaxy make it difficult to observe. Galactic astronomers attempt to understand the structure of galaxies and how they are formed through the use of different types of telescopes and computer simulations.\r\rGravitational wave astronomy \rGravitational wave astronomy is the study of the Universe in the gravitational wave spectrum. So far, all astronomy that has been done has used the electromagnetic spectrum. Gravitational waves are ripples in spacetime emitted by very dense objects changing shape, which include white dwarves, neutron stars and black holes. Because no one has been able to detect gravitational waves directly, the impact of Gravitational Wave Astronomy has been very limited.\r\rRelated pages \r\rAsteroid\rBlack hole\rComet\rList of comets\rGalaxy\rGlossary of astronomy\rMeteor\rPlanet\rPlanetarium\rSatellite (natural) (word for moons of other planets)\rScience tourism\rSolar system\rStar\rUniverse\rReferences \rOther websites \r[http://www.dustbunny.com/afk/ Astronomy site specifically designed for kids and their parents.]\r[http://antwrp.gsfc.nasa.gov/apod/ Astronomy Picture of the Day]\r\r",
                "docDate": 1622145223000,
                "domain": "s.wikipedia.org",
                "title": "Astronomy ",
                "url": "http://s.wikipedia.org/wiki/Astronomy",
                "_id": "24",
                "_highlights": {
                    "content": "The next great revolution in astronomy was thanks to the birth of rocketry. This allowed telescopes to be placed in space on satellites."
                },
                "_score": 0.622065
            },
            {
                "content": "Giraffe browsing\rA browser is a name given to any animal, usually a herbivorous mammal, which eats leaves and shrubs rather than grass. It is contrasted with grazers, which eat grass.\r\rCategory:Ecology\rCategory:Zoology",
                "docDate": 1607211317000,
                "domain": "s.wikipedia.org",
                "title": "Browser ",
                "url": "http://s.wikipedia.org/wiki/Browser",
                "_id": "42",
                "_highlights": {
                    "content": "Giraffe browsing\rA browser is a name given to any animal, usually a herbivorous mammal, which eats leaves and shrubs rather than grass. It is contrasted with grazers, which eat grass."
                },
                "_score": 0.6217965
            },
            {
                "content": "Gothic Revival architecture for Santuario de Las Lajas, Ipiales, Colombia\rThe Parthenon in Greece one of the seven wonders of the ancient world\r\rArchitecture is designing the structures of buildings. It uses both art and engineering. Examples include houses, churches, hotels, office buildings, roads, viaducts, tunnels and bridges.Architecture. Encyclopedia Britannica. Retrieved 27 October 2017. [https://www.britannica.com/topic/architecture] \r\rArchitecture is the profession of an architect. Usually, a person must study at an institution of higher education (university) to become an architect. There were architects long before there was higher education. They learnt by being an apprentice to an established architect. \r\rArchitecture can do small designs,Cole, Emily 2002. Architectural details. Ivy Press. ISBN 978-1-78240-169-8 such as for a garage, or large designs, such as for a whole city. The capital cities of Brasília, and Canberra were designed. Architecture often overlaps with structural engineering, and architects and engineers often work together.\r\r__TOC__\r\rHistory \rRomanesque groin vault\rIn the past, people built huts and wood houses to protect themselves from the weather. For safety, they were often close together. Great civilizations like the Ancient Egyptians built large temples and structures, like the Great Pyramids of Giza. The Ancient Greeks and Romans made what we now call \"Classical Architecture\". The Romans, working over 2000 years ago, copied the arch from the Etruscans, who copied it from the Mesopotamians.Risebero, Bill 2018. The story of Western architecture. Bloomsbury. ISBN 978-1-3500-9212-9Jarzombek, Mark 2014. Architecture of first societies: a global perspective. New York: Wiley. \r\rA simpler building, in Hungary\rClassical architecture was formal, and it always obeyed laws. It used symmetry, which really means balance, and it used proportion between shapes. The Golden Mean was a rule which said, (to put it simply) if you are making a room, or any other thing, it will work best if you always make the long side 1.6 times as long as the short side.Ching, Francis; Jarzombek, Mark & Prakash, Vikram. 2006. A global history of architecture. Wiley. There are many 'laws' in classical architecture, like how high the middle of an arched bridge needs to be (which depends on how wide the bridge needs to be). These laws were learned from thousands of years of experience and they are often used today. However, today more notice is taken of specific facts, such as what wind speeds occur once or twice in a century. Several bridges have blown down because that was not properly taken into consideration.\r\rIn some parts of the world, like India, the architecture is famous for carving the stone on temples and palaces. Different architectural styles occur in China, Japan, Southeast Asia, Africa, Mexico, and Central and South America.\r\rArchitects in Western Europe in the Middle Ages made Romanesque architecture, then Gothic architecture. Gothic buildings have tall, pointed windows and arches. Many churches have Gothic architecture. Castles were also built at this time. In Eastern Europe, churches usually had domes. People added their own ideas and decoration to the Classical Architecture of the past. The Renaissance brought a return to classical ideas. \rArchitecture can have many styles, such as the curved Guggenheim Museum in New York City\rIn the late 18th century with the Industrial Revolution, people began to invent machines to make things quickly and cheaply. Many factories and mills were built during, or after this revolution. Decades later, in the Victorian era, architects like George Fowler Jones and Decimus Burton still followed the Gothic style to build new churches. Up to this point, buildings were limited in size and style by the strength of the wood and masonry used to construct them. Gothic cathedrals were among the largest buildings because the gothic arch when combined with buttresses allowed stone buildings to be built taller. For example, the cathedral in Ulm, Germany is over 500 feet tall. However, building with stone has its limits, and building too tall could result in collapse. This happened to the Beauvais Cathedral, which was never completed. \rNew technology allows new kinds of buildings such as for the Willis Tower in Chicago\r\rTowards the end of the 19th Century with a second Industrial Revolution, steel became much cheaper. Architects began to use inventions like metal girders and reinforced concrete to build. An example is the Eiffel Tower in Paris. Buildings can now be built taller than ever before. We call them skyscrapers. This new technology has made us free from traditional limitations, and because of the new possibilities presented by these materials, many traditional methods of construction and ideas about style were reevaluated, replaced, or abandoned. Cheap, strong glass soon brought transparent exterior walls, especially for office buildings.\r\rModernism is the name for the architectural style which developed because of these new building technologies, and its beginnings can been seen as early as 1890. Modernism can also refer to a specific group of architects and buildings from the early to late 20th century, and so may not be the proper term to use for many building built since then, which are sometimes called \"post-modern\".\r\rMany of the world's greatest structures were built by modern-day architects such as Frank Lloyd Wright; Sir Hugh Casson; Norman Foster; I. M. Pei; Adrian Smith; Edward Durell Stone; Frank Gehry; Fazlur Khan; Gottfried Böhm; and Bruce Graham.\r\rRelated pages \rArchitect\rArt\rList of buildings\rSkyscraper\rStructural Engineering\rAcoustics\rBuilding code\rBuilding materials\rEarthquake engineering\rPattern language\rWorld Heritage Sites\r\rReferences \rOther websites\r\r[http://www.aia.org/index.htm American Institute of Architects] \r[http://www.architecture.com.au/ Australian Institute of Architects]\r[http://www.architecture.com/Home.aspx Royal Institute of British Architects]\r[http://www.raic.org/ Royal Architectural Institute of Canada]\r[http://www.nzia.co.nz/ New Zealand Institute of Architects]\r[http://en.citizendium.org/wiki/Architecture Architecture] Citizendium\rCategory:Architecture sciences\rCategory:Construction",
                "docDate": 1615484842000,
                "domain": "s.wikipedia.org",
                "title": "Architecture ",
                "url": "http://s.wikipedia.org/wiki/Architecture",
                "_id": "25",
                "_highlights": {
                    "content": "We call them skyscrapers. This new technology has made us free from traditional limitations, and because of the new possibilities presented by these materials, many traditional methods of construction and ideas about style were reevaluated, replaced, or abandoned."
                },
                "_score": 0.6206522
            },
            {
                "content": "Calculus is a branch of mathematics that helps us understand changes between values that are related by a function. For example, given a formula indicating how much money one gets every day, calculus would help one understand related formulas, such as how much money one has in total, and whether one is getting more or less money than before. Many of these formulas are functions of time, and one way to think of calculus is to see it as a study of functions of time.\r\rThere are two different types of calculus. Differential calculus divides things into small (different) pieces, and tells us how they change from one moment to the next, while integral calculus joins (integrates) the small pieces together, and tells us how much of something is made, overall, by a series of changes. Calculus is used in many different areas such as physics, astronomy, biology, engineering, economics, medicine and sociology.\rHistory\rIn the 1670s and 1680s, Sir Isaac Newton in England and Gottfried Leibniz in Germany figured out calculus at the same time, working separately from each other. Newton wanted to have a new way to predict where to see planets in the sky, because astronomy had always been a popular and useful form of science, and knowing more about the motions of the objects in the night sky was important for navigation of ships. Leibniz wanted to measure the space (area) under a curve (a line that is not straight). Many years later, the two men argued over who discovered it first. Scientists from England supported Newton, but scientists from the rest of Europe supported Leibniz. Most mathematicians today agree that both men share the credit equally. Some parts of modern calculus come from Newton, such as its uses in physics. Other parts come from Leibniz, such as the symbols used to write it.\r\rThey were not the first people to use mathematics to describe the physical world — Aristotle and Pythagoras came earlier, and so did Galileo Galilei, who said that mathematics was the language of science. But both Newton and Leibniz were the first to design a system that describes how things change over time, and can predict how they will change in the future.\r\rThe name \"calculus\" was the Latin word for a small stone the ancient Romans used in counting and gambling. The English word \"calculate\" comes from the same Latin word.\r\rDifferential calculus\rDifferential calculus is used to find the rate of change of a variable—compared to another variable. \r\rIn the real world, it can be used to find the speed of a moving object, or to understand how electricity and magnetism work. It is very important for understanding physics—and many other areas of science.\r\rDifferential calculus is also useful for graphing. It can be used to find the slope of a curve, and the highest and lowest points of a curve (these are called the maximum and minimum, respectively).\r\rVariables can change their value. This is different from numbers because numbers are always the same. For example, the number 1 is always equal to 1, and the number 200 is always equal to 200. One often write variables as letters such as the letter x: \"x\" can be equal to 1 at one point and 200 at another. \r\rSome examples of variables are distance and time, because they can change. The speed of an object is how far it travels in a particular time. So if a town is 80 kilometres (50 miles) away and a person in a car gets there in one hour, they have traveled at an average speed of 80 kilometres (50 miles) per hour. But this is only an average: maybe they travelled faster at some times (say on a highway), and slower at other times (say at a traffic light or on a small street where people live). Certainly it is more difficult for a driver to figure out a car's speed using only its odometer (distance meter) and clock—without a speedometer.\r\rUntil calculus was invented, the only way to work this out was to cut the time into smaller and smaller pieces, so the average speed over the smaller time would get closer and closer to the actual speed at a point in time. This was a very long and hard process, and had to be done each time people wanted to work something out.\r\rOn a curve, two different points have different slopes. The red and blue lines are tangents to the curve.\r\rA very similar problem is to find the slope (how steep it is) at any point on a curve. The slope of a straight line is easy to work out — it is simply how much it goes up or down (y or vertical) divided by how much it goes across (x or horizontal). On a curve, however, the slope is a variable (has different values at different points) because the line bends. But if the curve was to be cut into very, very small pieces, the curve at the point would look almost like a very short straight line. So to work out its slope, a straight line can be drawn through the point with the same slope as the curve at that point. If this is done exactly right, the straight line will have the same slope as the curve, and is called a tangent. But there is no way to know (without complex mathematics) whether the tangent is exactly right, and our eyes are not accurate enough to be certain whether it is exact or simply very close.\r\rWhat Newton and Leibniz found was a way to work out the slope (or the speed in the distance example) exactly, using simple and logical rules. They divided the curve into an infinite number of very small pieces. They then chose points on either side of the range they were interested in and worked out tangents at each. As the points moved closer together towards the point they were interested in, the slope approached a particular value as the tangents approached the real slope of the curve. The particular value it approached was the actual slope.\r\rA picture that shows what x and x + h mean on the curve.\r\rGiven a function y=f(x). f is short for function, so this equation means \"y is a function of x\". This tells us that how high y is on the vertical axis depends on what x (the horizontal axis) is at that time. For example, with the equation y=x^2, we know that if x is 1, then y will be 1; if x is 3, then y will be 9; if x is 20, then y will be 400. The slope of the tangent line produced using this method here is 2x, or 2 multiplied by x. So we know without having to draw any tangent line at any point on the curve f(x)=x^2 that the derivative, often written as f'(x) (marked with the prime symbol), will be 2x at any point. This process of working out a slope using limits is called differentiation, or finding the derivative.\r\rThe way to write the derivative in mathematics is\rf^\\prime(x) = \\lim_{h\\rightarrow0} \\frac{f(x+h) - f(x)}{h}.\r\rLeibniz came to the same result, but called h \"dx\", which means \"with respect to x\". He called the resulting change in f(x) \"dy\", which means \"a tiny amount of y\". Leibniz's notation is used by more books, because it is easy to understand when the equations become more complicated. In Leibniz notation:\r\\tfrac{dy}{dx} = f'(x).\r\rMathematicians have grown this basic theory to make simple algebra rules—which can be used to find the derivative of almost any function.\r\rIntegral calculus\rIntegration is about finding the areas, given a, b and y = f(x).\r\rIntegral calculus is the process of calculating the area underneath a graph of a function. An example is calculating the distance a car travels: if one knows the speed of the car at different points in time and draw a graph of this speed, then the distance the car travels will be the area under the graph.\r\rWe can approximate the area under a curve by adding up the areas of many rectangles underneath the curve. The more rectangles we use, the better our approximation.\rThe way to do this is to divide the graph into many very small pieces, and then draw very thin rectangles under each piece. As the rectangles become thinner and thinner, the rectangles cover the area underneath the graph better and better. The area of a rectangle is easy to calculate, so we can calculate the total area of all the rectangles. For thinner rectangles, this total area value approaches the area underneath the graph. The final value of the area is called the integral of the function.\r\rIn mathematics, the integral of the function f(x) from a to b, is written as\r\\int\\limits_{a}^{b} f(x)\\,dx.\r\rMain idea of calculus\rThe main idea in calculus is called the fundamental theorem of calculus. This main idea says that the two calculus processes, differentiation and integration, are inverses of each other. That is, a person can use differentiation to undo an integration process. Also, a person can use integration to undo a differentiation. This is just like using division to \"undo\" multiplication, or addition to \"undo\" subtraction.\r\rIn a single sentence, the fundamental theorem runs something like this: \"The derivative of the integral of a function f is the function itself\".\r\rApplications of calculus\rCalculus is used to describe things that change, like things in nature. It can be used for showing and learning all of these:\r\rHow waves move. Waves are very important in the natural world. For example, sound and light can be thought of as waves.\rWhere heat moves, like in a house. This is useful for architecture (building houses), so that the house can be as cheap to heat as possible.\rHow very small things like atoms act.\rHow fast something will fall, also known as gravity.\rHow machines work, also known as mechanics.\rThe path of the moon as it moves around the earth. Also, the path of the earth as it moves around the sun, and any planet or moon moving around anything in space.\r\rRelated pages \r\rCalculus of variations\rDifference quotient\rMathematical analysis\rMultivariable calculus\rVector calculus\r\rReferences \r\r",
                "docDate": 1614819265000,
                "domain": "s.wikipedia.org",
                "title": "Calculus ",
                "url": "http://s.wikipedia.org/wiki/Calculus",
                "_id": "84",
                "_highlights": {
                    "content": "The path of the moon as it moves around the earth. Also, the path of the earth as it moves around the sun, and any planet or moon moving around anything in space."
                },
                "_score": 0.61995244
            },
            {
                "content": "A cube has 6 sides of equal length and width\rA magnified crystal of salt\rA cube is a block with all right angles and whose height, width and depth are all the same. \r\rA cube is one of the simplest mathematical shapes in space. Something that is shaped like a cube is sometimes referred to as cubic.\rSurface area of cube=6l^2\rLateral Surface area of cube=4l^2\rVolume of cube=l^3\r\rRelative 2-dimensional shape \rThe basic difference between a cube and a square is, a cube is a 3D figure (having 3 dimensions) i.e. length, breadth and height while a square has only 2 dimensions i.e. length and breadth.\rThe 2-dimensional (2D) shape (like a circle, square, triangle, etc.) that a cube is made of is squares. The sides (faces) of a cube are squares. The edges are straight lines. The corners (vertices) are at right angles. A cube has 8 corners, 12 edges and 6 faces, as in the most usual kind of dice. A tesseract carries this idea into the fourth dimension (4D) and is made of 8 cubes.\r\rVolume \rThe volume of a cube is the length of any one of the edges (they are all the same length so it does not matter which edge is used) cubed. \rThis means you multiply the number by itself, and then by itself again. \rIf the edge is named 'd' (See Diagram), the equation would be this: Volume=d×d×d (or Volume=d3).\r\rCube shaped figures \rDice\rBoxes\r\rCategory:Platonic solids",
                "docDate": 1576513067000,
                "domain": "s.wikipedia.org",
                "title": "Cube ",
                "url": "http://s.wikipedia.org/wiki/Cube",
                "_id": "97",
                "_highlights": {
                    "title": "Cube"
                },
                "_score": 0.61937517
            },
            {
                "content": "American English or United States English is the dialect of the English language spoken in the United States of America. It is different in some ways from other types of English, such as British English. Many types of American English came from local dialects in England.\r\rMany people today know about American English even if they live in a country where another sort of English is spoken. This may be because people hear and read American English through the media, for example movies, television, and the Internet, where the most common form of English is American English.\r\rBecause people all over the world use the English language, it gets many new words. English has been changing in this way for hundreds of years. For example, the many millions who speak Indian English frequently add American English words to go along with its British English base and many other words from the various Indian languages. \r\rSometimes people learn American English as it is spoken in America. For example, in telephone call centers in India and other places, people often learn American English to sound more like their customers who call from America. These people often keep using American English in everyday life.\r\rThe meaning of many words are different in American English. Most changes in a language start with small things. For example, Italian, Spanish, and French all came from Latin.\r\rSpelling \rThere are many words that sound the same in both American English and British English, but are spelled differently. For example:\r\rWords originally from French that end in \"-our\" in British English (behaviour, colour, honour, neighbour, etc.) end in \"-or\" in American English (behavior, color, honor, neighbor). \rWords that come from French that end in -re in British English (metre, centre) end in -er in American English. In these cases Canadian English usage is to keep the British (and French) spelling.\rVerbs that end in -ise in British English (criticise, realise) end in -ize in American English (criticize, organize, realize). However, the -ize ending is optional in British English, and is shown as an option in British dictionaries.\rOne of the changes introduced by Noah Webster is the change of the double \"l\" from words like \"travelled\" to \"traveled\". \r\rBooks show that many of these differences come from the writings of English-lover Noah Webster, who made the American dictionary following the American War of Independence.\r\rSome more differences in American English:\raluminium is spelled \"aluminum\"\rdoughnut is sometimes spelled \"donut\"\rdraught is spelled \"draft\"\rgaol (not common) is spelled \"jail\"\rplough is spelled \"plow\"\r\rVocabulary \rThere are also some words in American English that are a bit different from British English, e.g.:\raeroplane is called \"airplane\"\rladybird is called \"ladybug\"\rlift is called \"elevator\"\rtoilet is called \"bathroom\", \"restroom\" or \"comfort station\"\rlorry is called \"truck\"\rnappies are called \"diapers\"\rpetrol is called \"gas\" (or \"gasoline\")\rthe boot of a car is called a \"trunk\"\ra dummy is called a \"pacifier\"\rtrousers are called \"pants\"\runderground is called \"subway\"\rfootball is called \"soccer\"\rbraces are \"suspenders\" (\"suspenders\" in British-English are a type of clothing worn around the lower leg by males to stop socks/sox from sagging, and around the upper leg by women wearing stockings)\r\rRegional accents \rGeneral American English is the kind most spoken in mass media. It more vigorously pronounces the letter \"R\" than some other kinds do. \"R-dropping\" is frequent in certain places where \"r\" sound is not pronounced after a vowel. For example as in the words \"car\" and \"card\" sounding like \"cah\" and \"cahd\". This occurs in the Boston area.\r\rCategory:Dialects of English\rCategory:Languages of the United States",
                "docDate": 1617706334000,
                "domain": "s.wikipedia.org",
                "title": "American English ",
                "url": "http://s.wikipedia.org/wiki/American_English",
                "_id": "14",
                "_highlights": {
                    "content": ":\raeroplane is called \"airplane\"\rladybird is called \"ladybug\"\rlift is called \"elevator\"\rtoilet is called \"bathroom\", \"restroom\" or \"comfort station\"\rlorry is called \"truck\"\rnappies are called \"diapers\"\rpetrol is called \"gas\" (or \"gasoline\")\rthe boot of a car is called a \"trunk\"\ra dummy is called a \"pacifier\"\rtrousers are called \"pants\"\runderground is called \"subway\"\rfootball is called \"soccer\"\rbraces are \"suspenders\" (\"suspenders\" in British-English are a type of clothing worn around the lower leg by males to stop socks/sox from sagging, and around the upper leg by women wearing stockings)\r\rRegional accents \rGeneral American English is the kind most spoken in mass media. It more vigorously pronounces the letter \"R\" than some other kinds do."
                },
                "_score": 0.61894506
            },
            {
                "content": "thumb\rChorizo is a pork (pig-meat) sausage which people first made in the Iberian Peninsula. It is made with large pieces of fatty pork, chili pepper and paprika. The special taste of this sausage comes from the mild Spanish paprika in it. \r\rIn the western hemisphere, the Mexican and Caribbean types are better known. These types of chorizo are made with smaller pieces of pork and different seasonings and peppers are used.\r\rCured smoked chorizo is edible and can be eaten without cooking. Fresh chorizo must be cooked before eating. It can be eaten by its self, or as part of meal. It can also be used in place of ground beef or pork.\r\rCategory:Sausage",
                "docDate": 1596209858000,
                "domain": "s.wikipedia.org",
                "title": "Chorizo ",
                "url": "http://s.wikipedia.org/wiki/Chorizo",
                "_id": "70",
                "_highlights": {
                    "title": "Chorizo"
                },
                "_score": 0.61827743
            },
            {
                "content": "Bubonic plague is the best-known form of the disease plague, which is caused by the bacterium Yersinia pestis. The name bubonic plague is specific for this form of the disease, which enters through the skin, and travels through the lymphatic system.\r\rThe plague was spread by fleas on rats. That kind of disease is called a zoonosis.\r\rIf the disease is left untreated, it kills about half its victims, in between three and seven days. The bubonic plague was the disease that caused the Black Death, which killed tens of millions of people in Europe, in the Middle Ages.\r\rSymptoms of this disease include coughing, fever, and black spots on the skin.\r\rDifferent kinds of the same disease \rThere are different kinds of Bubonic plague. The most common form of the disease is spread by a certain kind of flea, that lives on rats. Then there is an incubation period which can last from a few hours to about seven days.\r\rSepticemic plague \rSepsis happens when the bacterium enters the blood and makes it form tiny clots.\r\rPneumonic plague \rThis happens when the bacterium can enter the lungs. About 95% of all people with this form will die. Incubation period is only one to two days.\r\rThe abortive form \rThis is the most harmless form. It will result in a little fever. After that, there are antibodies that protect against all forms for a long time.\r\rHistory \rThe first recorded epidemic was in the Eastern Roman Empire (Byzantine Empire), It was called the Plague of Justinian after emperor Justinian I, who was infected but survived through extensive treatment.Little, Lester K. (2007). \"Life and Afterlife of the First Plague Pandemic.\" In: Little, Lester K. editor. (2007), Plague and the End of Antiquity: The Pandemic of 541–750. Cambridge University Press. (2007). pp. 8–15McCormick, Michael (2007). \"Toward a Molecular History of the Justinian Pandemic.\" In: Little, Lester K. editor. (2007), Plague and the End of Antiquity: The Pandemic of 541–750. Cambridge University Press. (2007). pp. 290–312. The pandemic resulted in the deaths of an estimated 25 million (6th century outbreak) to 50 million people (two centuries of recurrence).Rosen, William (2007), [http://www.justiniansflea.com/events.htm Justinian's Flea: Plague, Empire, and the Birth of Europe] . Viking Adult; pg 3; .Moorshead Magazines, Limited. \"The Plague of Justinian.\" History Magazine 11.1 (2009): 9–12. History Reference Center\r\rDuring the 1300s, this epidemic struck parts of Asia, North Africa, and Europe. Almost a third of the people in Europe died of it. Unlike catastrophes that pull communities together, this epidemic was so terrifying that it broke people's trust in one another. Giovanni Boccaccio, an Italian writer of the time, described it: \"This scourge had implanted so great a terror in the hearts of men and women that brothers abandoned brothers, uncles their nephews, sisters their brothers, and in many cases wives deserted their husbands. But even worse,... fathers and mothers refused to nurse and assist their own children\".The Decameron / Giovanni Boccaccio ; translated by Mark Musa & Peter Bondanella ; with an introduction by Thomas G. Bergin. \r\rDistribution of plague infected animals 1998\r\rLocal outbreaks of the plague are grouped into three plague pandemics, whereby the respective start and end dates and the assignment of some outbreaks to either pandemic are still subject to discussion. The pandemics were:\rthe first plague pandemic from 541 to ~750, spreading from Egypt to the Mediterranean (starting with the Plague of Justinian) and northwestern Europe\rthe second plague pandemic from ~1331 to ~1855, spreading from Central Asia to the Mediterranean and Europe (starting with the Black Death), and probably also to China\rthe third plague pandemic from 1855 to 1960, spreading from China to various places around the world, notably India and the West Coast of the United States.\r\rGlobally about 600 cases of plague are reported a year. In 2017 the countries with the most cases include the Democratic Republic of the Congo, Madagascar, and Peru.\r\rVector \rThe transmission of Y. pestis by fleas is well known. Fleas are the vector. The flea gets the bacteria as they feed on an infected animal, usually a rodent. Several proteins then work to keep the bacteria in the flea digestive tract. This is important for the survival of Y. pestis in fleas.\r\rModern history \rIn the 20th century, some countries did research on the bacteria that causes bubonic plague. They did research to use it for biological warfare.\r\rSamples of this bacteria are carefully controlled. There is much paranoia (fear) about it. Dr. Thomas C. Butler, a US expert in this organism was charged in October 2003 by the FBI with various crimes. This happened after he said he lost samples of Yersinia pestis. This is the bacteria that causes bubonic plague. The FBI did not find the samples. They do not know what happened to them.\r\rReferences \rCategory:Plague\rCategory:Pulmonology\rCategory:Zoonoses",
                "docDate": 1614240219000,
                "domain": "s.wikipedia.org",
                "title": "Bubonic plague ",
                "url": "http://s.wikipedia.org/wiki/Bubonic_plague",
                "_id": "52",
                "_highlights": {
                    "content": "They do not know what happened to them. References \rCategory:Plague\rCategory:Pulmonology\rCategory:Zoonoses"
                },
                "_score": 0.6154579
            },
            {
                "content": "160px\r160px\r\rAndouille is a type of pork sausage. It is spicy (hot in taste) and smoked. There are different kinds, all with different combinations of pork meat, fat, intestines (tubes going to the stomach), and tripe (the wall of the stomach).\r\rOther sorts are \"French andouille\" and \"German andouille\"; they are less spicy than Cajun. Cajun has extra salt, black pepper, and garlic. Andouille makers smoke the sausages over pecan wood and sugar cane for a maximum of seven or eight hours, at about 175 degrees Fahrenheit (80 degrees Celsius).\r\r\rCategory:Sausage",
                "docDate": 1608108213000,
                "domain": "s.wikipedia.org",
                "title": "Andouille ",
                "url": "http://s.wikipedia.org/wiki/Andouille",
                "_id": "9",
                "_highlights": {
                    "content": "Category:Sausage"
                },
                "_score": 0.6120977
            },
            {
                "content": "The Delta Pride Catfish farms.\rAquaculture is the farming of fish, shrimp, abalones, algae, and other seafood. Aquaculture supplies fish, such as catfish, salmon, and trout. It was developed a few thousand years ago in China. Aquaculture supplies over 20% of all the seafood harvested. \r\rFish farming has been practiced, in some parts of the world, for thousands of years. Goldfish originated about a thousand years ago in carp farms in China, and the Roman Empire farmed oysters and other seafood. Today, half of the seafood eaten in the U.S. is farmed. To help meet the growing global demand for seafood, aquaculture is growing fast.\r\rThe environmental impact of fish farming varies widely, depending on the species being farmed, the methods used and where the farm is located. When good practices are used, it's possible to farm seafood in a way that has very little impact to the environment. Such operations limit habitat damage, disease, escapes of farmed fish and the use of wild fish as feed.\rCategory:Agriculture\rCategory:Water",
                "docDate": 1548124398000,
                "domain": "s.wikipedia.org",
                "title": "Aquaculture ",
                "url": "http://s.wikipedia.org/wiki/Aquaculture",
                "_id": "15",
                "_highlights": {
                    "title": "Aquaculture"
                },
                "_score": 0.61181885
            },
            {
                "content": "A fan is used to move air.\r\rAir refers to the Earth's atmosphere. Air is a mixture of many gases and tiny dust particles. It is the clear gas in which living things live and breathe. It has an indefinite shape and volume. It has mass and weight, because it is matter. The weight of air creates atmospheric pressure. There is no air in outer space. \r\rAir is a mixture of about 78% of nitrogen, 21% of oxygen, 0.9% of argon, 0.04% of carbon dioxide, and very small amounts of other gases.Zimmer, Carl (3 October 2013). Earth’s Oxygen: a mystery easy to take for granted. New York Times. [https://www.nytimes.com/2013/10/03/science/earths-oxygen-a-mystery-easy-to-take-for-granted.html?_r=0] There is an average of about 1% water vapour.\r\rAnimals live and need to breathe the oxygen in the air. In breathing, the lungs put oxygen into the blood, and send back carbon dioxide to the air. Plants need the carbon dioxide in the air to live. They give off the oxygen that we breathe. Without it we die of asphyxia. \r\rWind is moving air, this is refreshing. This causes weather. \r\rAir can be polluted by some gases (such as carbon monoxide, hydrocarbons, and nitrogen oxides), smoke, and ash. This air pollution causes various problems including smog, acid rain and global warming. It can damage people's health and the environment. \r\rSince early times, air has been used to create technology. Ships moved with sails and windmills used the mechanical motion of air. Aircraft use propellers to move air over a wing, which allows them to fly. Pneumatics use air pressure to move things. Since the late 1900s, air power is also used to generate electricity. \r\rAir is invisible: it cannot be seen by the eye, though a shimmering in hot air can be seen.https://www.sciencefocus.com/planet-earth/why-is-air-invisible/\r\rAir is one of the four classical elements in Greek theory. It was considered an intervening element, somewhere between fire and water, and the driving force for the birth of the cosmos.\r\rBrief history \rEarth's atmosphere has changed much since its formation. \r\rOriginal atmosphere \rAt first it was mainly a hydrogen atmosphere. It has changed dramatically on several occasions—for example, the Great Oxygenation Event 2.4 billion years ago, greatly increased oxygen in the atmosphere from practically no oxygen to levels closer to present day. Humans have also contributed to significant changes in atmospheric composition through air pollution, especially since industrialisation, leading to rapid environmental change such as ozone depletion and global warming.\r\rSecond atmosphere \rOutgassing from volcanism, supplemented by gases produced during the late heavy bombardment of Earth by huge asteroids, produced the next atmosphere, consisting largely of nitrogen plus carbon dioxide and inert gases.Zahnle K; Schaefer L; & Fegley B. 2010. Earth's earliest atmospheres. Cold Spring Harbor Perspectives in Biology. 2 (10). PMID 20573713\r\rThird atmosphere \ryear=2016 }}[http://www.nap.edu/openbook/0309100615/gifmid/30.gif http://www.nap.edu/openbook/0309100615/gifmid/30.gif]\r\rThe constant re-arrangement of continents by plate tectonics influences the long-term evolution of the atmosphere. Carbon dioxide was transferred to and from large continental carbonate stores. Free oxygen did not exist in the atmosphere until about 2.4 billion years ago. The Great Oxygenation Event is shown by the end of the banded iron formations.\r\rRelated pages \rAir pollution\rAir craft\r\rReferences \r\rCategory:Basic English 850 words\rCategory:Physics\rCategory:Atmosphere",
                "docDate": 1621353278000,
                "domain": "s.wikipedia.org",
                "title": "Air ",
                "url": "http://s.wikipedia.org/wiki/Air",
                "_id": "4",
                "_highlights": {
                    "content": "2010. Earth's earliest atmospheres."
                },
                "_score": 0.6099859
            },
            {
                "content": "Granny Smith green apples\r\rThe apple tree (Malus domestica) is a tree that grows apples. It is best known for this juicy, tasty fruit. The tree is grown worldwide. Its fruit is low-cost, and is harvested all over the world. \r\rThe apple tree came from Kazakhstan from Almaty.https://www.practicaespanol.com/en/the-first-apple-of-the-world-was-born-in-kazakhstan/ Apples have been grown for thousands of years in Asia and Europe. They were brought to North America by European settlers. Apples have religious and mythological significance in many cultures.\r\rApples are generally propagated by grafting, although wild apples grow readily from seed. Apple trees are large if grown from seed, but small if grafted onto roots (rootstock). There are more than 7,500 known cultivars of apples, with a range of desired characteristics. Different cultivars are bred for various tastes and uses: cooking, eating raw and cider production are the most common uses. \r\rTrees and fruit are attacked by fungi, bacteria and pests. In 2010, the fruit's genome was sequenced as part of research on disease control and selective breeding in apple production.\r\rWorldwide production of apples in 2013 was 90.8 million tonnes. China grew 49% of the total.\r\rBotanical information \rThe apple has a small, leaf-shedding tree that grows up to tall. The apple tree has a broad crown with thick twigs.\rThe leaves are alternately arranged simple ovals. They are 5 to 12 centimetres long and 3–6centimetres (1.2–2.4in) wide. It has a sharp top with a soft underside. Blossoms come out in spring at the same time that the leaves begin to bud. The flowers are white. They also have a slightly pink color. They are five petaled, and 2.5 to 3.5 centimetres (0.98 to 1.4 in) in diameter. The fruit matures in autumn. It is usually 5 to 9 centimetres (2.0 to 3.5 in) in diameter. There are five carpels arranged in a star in the middle of the fruit. Every carpel has one to three seeds.\rWild Malus sieversii apple in Kazakhstan\r\rWild ancestors \rThe wild ancestor of apple trees is Malus sieversii. They grow wild in the mountains of Central Asia in the north of Kazakhstan, Kyrgyzstan, Tajikistan, and Xinjiang, China, and possibly also Malus sylvestris. Unlike domesticated apples, their leaves become red in autumn.Archetti M. (2009). [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2684696/pdf/rspb20090355.pdf Evidence from the domestication of apple for the maintenance of autumn colours by coevolution.] Proc Biol Sci. 276(1667):2575-80. PMID 19369261 They are being used recently to develop Malus domestica to grow in colder climates.\r\rHistory\r\rThe apple tree was possibly the earliest tree to be cultivated. Its fruits have become better over thousands of years. It is said that Alexander the Great discovered dwarf apples in Asia Minor in 300 BC. Asia and Europe have used winter apples as an important food for thousands of years. From when Europeans arrived, Argentina and the United States have used apples as food as well. Apples were brought to North America in the 1600s. The first apple orchard on the North American continent was said to be near Boston in 1625. In the 1900s, costly fruit industries, where the apple was a very important species, began developing.\r\rIn culture \rPaganism \r\"Brita as Iduna\" (1901) by Carl Larsson\rJoseph Kleitsch: Madonna of the apples (1927)\r\rIn Norse mythology, the goddess Iðunn gives apples to the gods in Prose Edda (written in the 13th century by Snorri Sturluson) that makes them young forever. English scholar H. R. Ellis Davidson suggests that apples were related to religious practices in Germanic paganism. It was from there, she claims, that Norse paganism developed. She points out that buckets of apples were discovered in the place of burial for the Oseberg ship in Norway. She also remarks that fruit and nuts (Iðunn having been described as changing into a nut in Skáldskaparmál) have been discovered in the early graves of the Germanic peoples in England. They have also been discovered somewhere else on the continent of Europe. She suggests that this may have had a symbolic meaning. Nuts are still a symbol of fertility in Southwest England.\r\rCooking \rSometimes apples are eaten after they are cooked. Often apples are eaten uncooked. Apples can also be made into drinks. Apple juice and apple cider are apple drinks. \r\rThe flesh of the fruit is firm with a taste anywhere from sour to sweet. Apples used for cooking are sour, and need to be cooked with sugar, while other apples are sweet, and do not need cooking. There are some seeds at the core, that can be removed with a tool that removes the core, or by carefully using a knife.\r\rThe scientific name of the apple tree genus in the Latin language is Malus. Most apples that people grow are of the Malus domestica species.\r\rMost apples are good to eat raw (not cooked), and are also used in many kinds of baked foods, such as apple pie. Apples are cooked until they are soft to make apple sauce.\r\rApples are also made into the drinks apple juice and cider. Usually, cider contains a little alcohol, about as much as beer. The regions of Brittany in France and Cornwall in England are known for their apple ciders.\r\rApple cultivars \rIf one wants to grow a certain type of apple it is not possible to do this by planting a seed from the wanted type. The seed will have DNA from the apple that the seeds came from, but it will also have DNA from the apple flower that pollinated the seeds, which may well be a different type. This means that the tree which would grow from planting would be a mixture of two. In order to grow a certain type of apple, a small twig, or 'scion', is cut from the tree that grows the type of apple desired, and then added on to a specially grown stump called a rootstock. The tree that grows will only create apples of the type needed.\r\rThere are more than 7,500 known cultivars (varieties) of apples. Different cultivars are available for temperate and subtropical climates. One large collection of over 2,100 apple cultivars is at the National Fruit Collection in England. Most of these cultivars are grown for eating fresh (dessert apples). However, some are grown simply for cooking or making cider. Cider apples are usually too tart to eat immediately. However, they give cider a rich flavor that dessert apples cannot.\r\rMost popular apple cultivars are soft but crisp. Colorful skin, easy shipping, disease resistance, 'Red Delicious' apple shape, and popular flavor are also needed. Modern apples are usually sweeter than older cultivars. This is because popular tastes in apples have become different. Most North Americans and Europeans enjoy sweet apples. Extremely sweet apples with hardly any acid taste are popular in Asia and India.\r\rIn the United Kingdom \rIn the United Kingdom there are about 3000 different types of apples. The most common apple type grown in England is the 'Bramley seedling', which is a popular cooking apple.\r\rApple orchards are not as common as they were in the early 1900s, when apples were rarely brought in from other countries. Organizations such as [http://www.commonground.org.uk/ Common Ground] teach people about the importance of rare and local varieties of fruit.\r\rIn North America \rMany apples are grown in temperate parts of the United States and Canada. In many areas where apple growing is important, people have huge celebrations:\r\rAnnapolis Valley Apple Blossom Festival - held five days every spring (May-June) in Nova Scotia\rShenandoah Apple Blossom Festival - held six days every spring in Winchester, Virginia.\rWashington State Apple Blossom Festival - held two weeks every spring (April-May) in Wenatchee, Washington\r\rVarieties of apples \rA golden delicious apple.\rThere are many different varieties of apples, including:\r\rAport\rCox's Orange Pippin\rFuji (apple)\rGala\rGolden Delicious (sometimes called a Green Delicious Apple)\rGranny Smith\rJonathan\rJonagold\rMcIntosh\rPink Lady\rRed Delicious\rWinesap\r\rFamily \rApples are in the group Maloideae. This is a subfamily of the family Rosaceae. They are in the same subfamily as pears.\r\rReferences\rFurther reading \rPotter D. et al 2007. Phylogeny and classification of Rosaceae. Plant Systematics and Evolution. 266 (1–2): 5–43.\r\rOther websites \r\r\r\rCategory:Basic English 850 words\r\rCategory:Rosaceae",
                "docDate": 1621922775000,
                "domain": "s.wikipedia.org",
                "title": "Apple ",
                "url": "http://s.wikipedia.org/wiki/Apple",
                "_id": "20",
                "_highlights": {
                    "title": "Apple"
                },
                "_score": 0.60766786
            },
            {
                "content": "The four classical elements.\r\rThe Greek classical elements are fire, air, water, and earth. In Greek philosophy, science and medicine, these make up a whole.\r\rFire is both hot and dry.\rAir is both hot and wet.\rWater is both cold and wet.\rEarth is both cold and dry.\r\rThe image below has two squares on top of each other. The corners of one are the classical elements. The corners of the other are the properties.\r\rGalen said these elements were used by Hippocrates to describe the human body. The elements are linked to the four humours: phlegm (water), yellow bile (fire), black bile (earth), and blood (air).\r\rIn Chinese Taoism the elements are metal, wood, water, fire, earth ().\r\rCategory:Ancient Greece\rCategory:History of science",
                "docDate": 1487556199000,
                "domain": "s.wikipedia.org",
                "title": "Classical element ",
                "url": "http://s.wikipedia.org/wiki/Classical_element",
                "_id": "63",
                "_highlights": {
                    "content": "Galen said these elements were used by Hippocrates to describe the human body. The elements are linked to the four humours: phlegm (water), yellow bile (fire), black bile (earth), and blood (air)."
                },
                "_score": 0.60702646
            },
            {
                "content": "Atoms are very small pieces of matter. There are many different types of atoms, each with its own name, mass and size. These different types of atoms are called chemical elements. The chemical elements are organized on the periodic table. Examples of elements are hydrogen and gold.\r\rAtoms are very small, but their exact size depends on the element. Atoms range from 0.1 to 0.5 nanometers in width. One nanometer is about 100,000 times smaller than the width of a human hair. This makes atoms impossible to see without special tools. Scientists discover how they work and interact with other atoms through experiments.\r\rAtoms can join together to make molecules: for example, two hydrogen atoms and one oxygen atom combine to make a water molecule. When atoms join together it is called a chemical reaction.\r\rAtoms are made up of three kinds of smaller particles, called protons, neutrons and electrons. The protons and neutrons are heavier, and stay in the middle of the atom, which is called the nucleus. The nucleus is surrounded by a cloud of light-weight electrons, these are attracted to the protons in the nucleus by the electromagnetic force because they have opposite electric charges.\r\rThe number of protons an atom has defines what chemical element it is, this number is sometimes called its atomic number. For example, hydrogen has one proton and sulfur has 16 protons. Because the mass of neutrons and protons is very similar, and the mass of electrons is very small, we can call the amount of protons and neutrons in an atom its atomic mass.\r\rAtoms move faster when they are in their gas form (because they are free to move) than they do in liquid form and solid matter. In solid materials, the atoms are tightly packed next to each other so they vibrate, but are not able to move (there is no room) as atoms in liquids do.\r\rHistory \rThe word \"atom\" comes from the Greek (ἀτόμος) \"atomos\", indivisible, from (ἀ)-, not, and τόμος, a cut. The first historical mention of the word atom came from works by the Greek philosopher Democritus, around 400 BC. Atomic theory stayed as a mostly philosophical subject, with not much actual scientific investigation or study, until the development of chemistry in the 1650s.\r\rIn 1777 French chemist Antoine Lavoisier defined the term element for the first time. He said that an element was any basic substance that could not be broken down into other substances by the methods of chemistry. Any substance that could be broken down was a compound.\r\rIn 1803, English philosopher John Dalton suggested that elements were tiny, solid balls made of atoms. Dalton believed that all atoms of the same element have the same mass. He said that compounds are formed when atoms of more than one element combine. According to Dalton, in a certain compound, the atoms of the compound's elements always combine the same way.\r\rIn 1827, British scientist Robert Brown looked at pollen grains in water under his microscope. The pollen grains appeared to be jiggling. Brown used Dalton's atomic theory to describe patterns in the way they moved. This was called brownian motion. In 1905 Albert Einstein used mathematics to prove that the seemingly random movements were caused by the reactions of atoms, and by doing this he conclusively proved the existence of the atom.\rIn 1869, Russian scientist Dmitri Mendeleev published the first version of the periodic table. The periodic table groups elements by their atomic number (how many protons they have. This is usually the same as the number of electrons).\rElements in the same column, or period, usually have similar properties. For example, helium, neon, argon, krypton and xenon are all in the same column and have very similar properties. All these elements are gases that have no colour and no smell. Also, they are unable to combine with other atoms to form compounds. Together they are known as the noble gases.\r\rThe physicist J.J. Thomson was the first person to discover electrons. This happened while he was working with cathode rays in 1897. He realized they had a negative charge, unlike protons (positive) and neutrons (no charge). Thomson created the plum pudding model, which stated that an atom was like plum pudding: the dried fruit (electrons) were stuck in a mass of pudding (protons). In 1909, a scientist named Ernest Rutherford used the Geiger–Marsden experiment to prove that most of an atom is in a very small space called the atomic nucleus. Rutherford took a photo plate and covered it with gold foil, and then shot alpha particles (made of two protons and two neutrons stuck together) at it. Many of the particles went through the gold foil, which proved that atoms are mostly empty space. Electrons are so small they make up only 1% of an atom's mass.\r\rErnest Rutherford\r\rIn 1913, Niels Bohr introduced the Bohr model. This model showed that electrons travel around the nucleus in fixed circular orbits. This was more accurate than the Rutherford model. However, it was still not completely right. Improvements to the Bohr model have been made since it was first introduced.\r\rIn 1925, chemist Frederick Soddy found that some elements in the periodic table had more than one kind of atom.\rFor example, any atom with 2 protons should be a helium atom. Usually, a helium nucleus also contains two neutrons. However, some helium atoms have only one neutron. This means they truly are helium, because an element is defined by the number of protons, but they are not normal helium, either. Soddy called an atom like this, with a different number of neutrons, an isotope. To get the name of the isotope we look at how many protons and neutrons it has in its nucleus and add this to the name of the element. So a helium atom with two protons and one neutron is called helium-3, and a carbon atom with six protons and six neutrons is called carbon-12. However, when he developed his theory Soddy could not be certain neutrons actually existed. To prove they were real, physicist James Chadwick and a team of others created the mass spectrometer. The mass spectrometer actually measures the mass and weight of individual atoms. By doing this Chadwick proved that to account for all the weight of the atom, neutrons must exist.\r\rIn 1937, German chemist Otto Hahn became the first person to create nuclear fission in a laboratory. He discovered this by chance when he was shooting neutrons at a uranium atom, hoping to create a new isotope. However, he noticed that instead of a new isotope the uranium simply changed into a barium atom, a smaller atom than uranium. Apparently, Hahn had \"broken\" the uranium atom. This was the world's first recorded nuclear fission reaction. This discovery eventually led to the creation of the atomic bomb.\r\rFurther into the 20th century, physicists went deeper into the mysteries of the atom. Using particle accelerators they discovered that protons and neutrons were actually made of other particles, called quarks.\r\rThe most accurate model so far comes from the Schrödinger equation. Schrödinger realized that the electrons exist in a cloud around the nucleus, called the electron cloud. In the electron cloud, it is impossible to know exactly where electrons are. The Schrödinger equation is used to find out where an electron is likely to be. This area is called the electron's orbital.\r\rStructure and parts \rParts \rThe complex atom is made up of three main particles; the proton, the neutron and the electron. The isotope of Hydrogen Hydrogen-1 has no neutrons, just the one proton and one electron. Protons have a positive electric charge and electrons have a negative charge. A positive hydrogen ion has no electrons, just the one proton. These two examples are the only known exceptions to the rule that all other atoms have at least one proton, one neutron and one electron each.\r\rElectrons are by far the smallest of the three atomic particles, their mass and size is too small to be measured using current technology. They have a negative charge. Protons and neutrons are of similar size and weight to each other, protons are positively charged and neutrons have no charge.\rMost atoms have a neutral charge; because the number of protons (positive) and electrons (negative) are the same, the charges balance out to zero. However, in ions (different number of electrons) this is not always the case, and they can have a positive or a negative charge. Protons and neutrons are made out of quarks, of two types; up quarks and down quarks. A proton is made of two up quarks and one down quark and a neutron is made of two down quarks and one up quark.\r\rNucleus \rThe nucleus is in the middle of an atom. It is made up of protons and neutrons. Usually in nature, two things with the same charge repel or shoot away from each other. So for a long time it was a mystery to scientists how the positively charged protons in the nucleus stayed together. They solved this by finding a particle called a gluon. Its name comes from the word glue as gluons act like atomic glue, sticking the protons together using the strong nuclear force. It is this force which also holds the quarks together that make up the protons and neutrons.\r\rA diagram showing the main difficulty in nuclear fusion, the fact that protons, which have positive charges, repel each other when forced together.\r\rThe number of neutrons in relation to protons defines whether the nucleus is stable or goes through radioactive decay. When there are too many neutrons or protons, the atom tries to make the numbers the same by getting rid of the extra particles. It does this by emitting radiation in the form of alpha, beta or gamma decay. Nuclei can change through other means too. Nuclear fission is when the nucleus splits into two smaller nuclei, releasing a lot of stored energy. This release of energy is what makes nuclear fission useful for making bombs and electricity, in the form of nuclear power.\rThe other way nuclei can change is through nuclear fusion, when two nuclei join together, or fuse, to make a heavier nucleus. This process requires extreme amounts of energy in order to overcome the electrostatic repulsion between the protons, as they have the same charge. Such high energies are most common in stars like our Sun, which fuses hydrogen for fuel.\r\rElectrons \rElectrons orbit, or travel around, the nucleus. They are called the atom's electron cloud. They are attracted towards the nucleus because of the electromagnetic force. Electrons have a negative charge and the nucleus always has a positive charge, so they attract each other.\rAround the nucleus, some electrons are further out than others, in different layers. These are called electron shells. In most atoms the first shell has two electrons, and all after that have eight. Exceptions are rare, but they do happen and are difficult to predict. The further away the electron is from the nucleus, the weaker the pull of the nucleus on it. This is why bigger atoms, with more electrons, react more easily with other atoms.\rThe electromagnetism of the nucleus is not strong enough to hold onto their electrons and atoms lose electrons to the strong attraction of smaller atoms.\r\rRadioactive decay \rSome elements, and many isotopes, have what is called an unstable nucleus. This means the nucleus is either too big to hold itself together or has too many protons or neutrons. When this happens the nucleus has to get rid of the excess mass or particles. It does this through radiation. An atom that does this can be called radioactive. Unstable atoms continue to be radioactive until they lose enough mass/particles that they become stable. All atoms above atomic number 82 (82 protons, lead) are radioactive.\r\rThere are three main types of radioactive decay; alpha, beta and gamma.\rAlpha decay is when the atom shoots out a particle having two protons and two neutrons. This is essentially a helium nucleus. The result is an element with atomic number two less than before. So for example if a beryllium atom (atomic number 4) went through alpha decay it would become helium (atomic number 2). Alpha decay happens when an atom is too big and needs to get rid of some mass.\rBeta decay is when a neutron turns into a proton or a proton turns into a neutron. In the first case the atom shoots out an electron. In the second case it is a positron (like an electron but with a positive charge). The end result is an element with one higher or one lower atomic number than before. Beta decay happens when an atom has either too many protons, or too many neutrons.\rGamma decay is when an atom shoots out a gamma ray, or wave. It happens when there is a change in the energy of the nucleus. This is usually after a nucleus has already gone through alpha or beta decay. There is no change in the mass, or atomic number or the atom, only in the stored energy inside the nucleus.\r\rEvery radioactive element or isotope has what is named a half-life. This is how long it takes half of any sample of atoms of that type to decay until they become a different stable isotope or element. Large atoms, or isotopes with a big difference between the number of protons and neutrons will therefore have a long half life, because they must lose more neutrons to become stable.\r\rMarie Curie discovered the first form of radiation. She found the element and named it radium. She was also the first female recipient of the Nobel Prize.\r\rFrederick Soddy conducted an experiment to observe what happens as radium decays. He placed a sample in a light bulb and waited for it to decay. Suddenly, helium (containing 2 protons and 2 neutrons) appeared in the bulb, and from this experiment he discovered this type of radiation has a positive charge.\r\rJames Chadwick discovered the neutron, by observing decay products of different types of radioactive isotopes. Chadwick noticed that the atomic number of the elements was lower than the total atomic mass of the atom. He concluded that electrons could not be the cause of the extra mass because they barely have mass.\r\rEnrico Fermi, used the neutrons to shoot them at uranium. He discovered that uranium decayed a lot faster than usual and produced a lot of alpha and beta particles. He also believed that uranium got changed into a new element he named hesperium.\r\rOtto Hahn and Fritz Strassmann repeated Fermi's experiment to see if the new element hesperium was actually created. They discovered two new things Fermi did not observe. By using a lot of neutrons the nucleus of the atom would split, producing a lot of heat energy. Also the fission products of uranium were already discovered: thorium, palladium, radium, radon and lead.\r\rFermi then noticed that the fission of one uranium atom shot off more neutrons, which then split other atoms, creating chain reactions. He realised that this process is called nuclear fission and could create huge amounts of heat energy.\r\rThat very discovery of Fermi's led to the development of the first nuclear bomb code-named 'Trinity'.\r\rReferences \rOther websites \r[http://web.jjay.cuny.edu/~acarpi/NSC/3-atoms.htm General information on atomic structure] \r[http://www.watertown.k12.wi.us/HS/Staff/Buescher/atomtime.asp Atomic structure timeline] \r[http://en.citizendium.org/wiki/Atom_(science) Atom (science) -Citizendium]\r\rCategory:Chemistry\rCategory:Nuclear physics",
                "docDate": 1621495966000,
                "domain": "s.wikipedia.org",
                "title": "Atom ",
                "url": "http://s.wikipedia.org/wiki/Atom",
                "_id": "23",
                "_highlights": {
                    "title": "Atom"
                },
                "_score": 0.6063397
            },
            {
                "content": "A circle\r\rA circle is a round, two-dimensional shape. All points on the edge of the circle are at the same distance from the center. \r\rThe radius of a circle is a line from the centre of the circle to a point on the side. Mathematicians use the letter r for the length of a circle's radius. The centre of a circle is the point in the very middle. It is sometimes written as O.\r\rThe diameter (meaning \"all the way across\") of a circle is a straight line that goes from one side to the opposite and right through the centre of the circle. Mathematicians use the letter d for the length of this line. The diameter of a circle is equal to twice its radius (d equals 2 times r):\r\r:\rd = 2\\ r \rThe circumference (meaning \"all the way around\") of a circle is the line that goes around the centre of the circle. Mathematicians use the letter C for the length of this line.\r\rThe number π (written as the Greek letter pi) is a very useful number. It is the length of the circumference divided by the length of the diameter (π equals C divided by d). As a fraction the number π is equal to about or 355/113 (which is closer) and as a number it is about 3.1415926535.\rThe area of the circle is equal to π times the area of the gray square.\rThe area, A, inside a circle is equal to the radius multiplied by itself, then multiplied by π (A equals π times r times r).\r\r:A = \\pi \\, r^2 \r\rCalculating π\rπ can be measured by drawing a large circle, then measuring its diameter (d) and circumference (C). This is because the circumference of a circle is always π times its diameter.\r\r:\\pi = \\frac{C}{d}\r\rπ can also be calculated by only using mathematical methods. Most methods used for calculating the value of π have desirable mathematical properties. However, they are hard to understand without knowing trigonometry and calculus. However, some methods are quite simple, such as this form of the Gregory-Leibniz series:\r\r: \\pi = \\frac{4}{1}-\\frac{4}{3}+\\frac{4}{5}-\\frac{4}{7}+\\frac{4}{9}-\\frac{4}{11}\\cdots .\r\rWhile that series is easy to write and calculate, it is not easy to see why it equals π. A much easier way to approach is to draw an imaginary circle of radius r centered at the origin. Then any point (x,y) whose distance d from the origin is less than r, calculated by the Pythagorean theorem, will be inside the circle:\r\r: d = \\sqrt{x^2 + y^2}\r\rFinding a set of points inside the circle allows the circle's area A to be estimated, for example, by using integer coordinates for a big r. Since the area A of a circle is π times the radius squared, π can be approximated by using the following formula:\r\r: \\pi = \\frac{A}{r^2} \r\rRelated pages\rSemicircle\rSphere\rSquaring the circle\rTau\r\rReferences \rOther websites \r\r[http://www.mathepower.com/english/kreis.php Calculate the measures of a circle online] \r\rCategory:Shapes\rCategory:Conic sections",
                "docDate": 1621268308000,
                "domain": "s.wikipedia.org",
                "title": "Circle ",
                "url": "http://s.wikipedia.org/wiki/Circle",
                "_id": "94",
                "_highlights": {
                    "title": "Circle"
                },
                "_score": 0.6042999
            },
            {
                "content": "Time Cube was a personal website created on 1997 by Otis Eugene Ray. On that website, Ray explained his theory of everything, known as \"Time Cube\". It described the planet Earth as having a cubic symmetry, and time as rotating four \"corners\". He also said that all of modern physics is wrong. Scientists reject these ideas, saying that they make no sense and cannot be tested.\r\rThe Time Cube website was written in an angry and hateful voice. On his site, Ray said that not believing in Time Cube would be \"stupid and evil\". Some of the comments were racist and discriminatory, especially against black people and Jews. There were also many comments against gay people. Many people found the site to be difficult to understand. \r\rRay spoke about Time Cube at the Massachusetts Institute of Technology in January 2002. At MIT, a professor tried to cancel the lecture before it took place. Ray believed this is proof of a conspiracy to keep information about Time Cube hidden. Ray also spoke about Time Cube at the Georgia Institute of Technology in April 2005.[https://smartech.gatech.edu/bitstream/1853/7877/3/focus-2005-04-22.pdf \"Oddball Time Cube theorist piques interest, elicits mixed response\"], by Joshua Cuneo, The Technique. Georgia Institute of Technology. April 22, 2005. Retrieved July 25, 2010.\r\rOtis Eugene Ray died on March 18, 2015. He was 87 years old. The website went down on August 2015. It was last archived by the Wayback Machine on January 12, 2016. A theory of everything (TOE or ToE), final theory, ultimate theory, or master theory is a hypothetical single, all-encompassing, coherent theoretical framework of physics that fully explains and links together all physical aspects of the universe.\r\rRelated pages \rConspiracy theory\rPseudoscience\r\rReferences \rCategory:Pseudoscience\rCategory:American websites\rCategory:1997 establishments in the United States\rCategory:Conspiracy theories",
                "docDate": 1619044319000,
                "domain": "s.wikipedia.org",
                "title": "Time Cube ",
                "url": "http://s.wikipedia.org/wiki/Time_Cube",
                "_id": "80",
                "_highlights": {
                    "title": "Time Cube"
                },
                "_score": 0.6039458
            },
            {
                "content": "Belgium, officially the Kingdom of Belgium (Dutch: Koninkrijk België, German: Königreich Belgien, French: Royaume de Belgique), is a federal state in Western Europe. Belgium has an area of . Around 11 million people live in Belgium. It is a founding member of the European Union and is home to its headquarters. The capital city of Belgium is Brussels, where the European Union, NATO and other famous organisations are based.\r\rThere are three regions in Belgium:\rFlanders is the name of the northern half of Belgium, just south of the Netherlands. Most of the people in this region, called the Flemish people, speak Dutch.\rWallonia is the name of the southern half of Belgium, just north of France. Here, most of the people, the Walloons, speak French. There is a small part of Wallonia next to the border with Germany where the people speak German.\rThe Brussels-Capital Region, where the capital of Brussels is found, is in the middle of the country, but surrounded by Flanders on all sides. It used to be Dutch-speaking, but today French is mostly spoken, with some Dutch.\rThe population is about 60% Dutch-speaking, 39% French-speaking, and 1% German-speaking (the so-called Deutschbelgier). To look after all these groups, Belgium has a complicated system of government.\r\rHistory\rThe Seventeen Provinces (orange, brown and yellow areas) and the Bishopric of Liège (green)\rPhilippe of Belgium, current King.\rThe name 'Belgium' comes from Gallia Belgica. This was a Roman province in the northernmost part of Gaul. Before Roman invasion in 100 BC, the Belgae, a mix of Celtic and Germanic peoples, lived there. (Paperback 512pp: ; Revised edition (2002), Hardcover 636pp: ) The Germanic Frankish tribes during the 5th century brought the area under the rule of the Merovingian kings. A slow shift of power during the 8th century led the kingdom of the Franks to change into the Carolingian Empire.Cook (2002), p. 3 The Treaty of Verdun in 843 divided the region into Middle and West Francia. They were vassals either of the King of France or of the Holy Roman Emperor.\rMany of these fiefdoms were united in the Burgundian Netherlands of the 14th and 15th centuries.\r\rThe Eighty Years' War (1568–1648) divided the Low Countries into the northern United Provinces and the Southern Netherlands. Southern Netherlands were ruled by the Spanish and the Austrian Habsburgs. This made up most of modern Belgium.\r\rAfter the campaigns of 1794 in the French Revolutionary Wars, the Low Countries were added into the French First Republic. This ended Austrian rule in the area. Adding back the Low Countries formed the United Kingdom of the Netherlands. This happened at the end of the First French Empire in 1815.\r\rThe Belgian Revolution was in 1830. Leopold I became king on 1831. This is now celebrated as Belgium's National Day.\r\rEpisode of the Belgian Revolution of 1830 (1834), by Egide Charles Gustave Wappers, Museum of Ancient Art, Brussels\r\rThe Berlin Conference of 1885 gave control of the Congo Free State to King Leopold II. This was for him personally and not for the country of Belgium. Millions of Congolese people were hurt or killed, mostly to make rubber, and Leopold became very wealthy. In 1908 the Belgian state took control of the colony after there was a scandal about the deaths. It was then called the Belgian Congo, but the indigenous peoples continued to be killed and face violence from the colonial government.\r\rGermany invaded Belgium in 1914. This was part of World War I. The opening months of the war were very bad in Belgium. During the war Belgium took over the of Ruanda-Urundi (modern-day Rwanda and Burundi). After the First World War, the Prussian districts of Eupen and Malmedy were added into Belgium in 1925. The country was again invaded by Germany in 1940 and under German control until 1944. After World War II, the people made king Leopold III leave his throne in 1951. This is because they thought he helped the Germans.\r\rIn 1960 the Belgian Congo stopped being under Belgian rule. Two years later Ruanda-Urundi also became free. Belgium joined NATO as a founding member.\r\rGovernment and politics \rSince 1993, Belgium is a federal state, divided into three regions and three communities.\r\rRegions:\rBrussels-Capital Region\rFlemish Region (or Flanders)\rWalloon Region (or Wallonia)\r\rCommunities:\rFlemish Community\rFrench Community of Belgium\rGerman-speaking Community of Belgium\r\rIt has a system of government known as a constitutional monarchy, meaning that it has a monarch, but that the monarch does not rule the country, and that a government is elected democratically.\r\rBelgium has had its own monarchy since 1831. King Albert II left the throne on July 21, 2013 and the current king is Philippe.\r\rIn Belgium, the government is elected. Between mid-2010 and late 2011, after no clear result in the election, Belgium had no official government, until Elio Di Rupo became Prime Minister. Flanders and Wallonia both also have their own regional governments, and there is a notable independence movement in Flanders. Charles Michel is currently the Prime Minister.\rGeography \rBelgium is next to France, Germany, Luxembourg and the Netherlands. Its total area is 33,990 square kilometers. The land area alone is 30,528 km². Belgium has three main geographical regions. The coastal plain is in the north-west. The central plateau are part of the Anglo-Belgian Basin. The Ardennes uplands are in the south-east. The Paris Basin reaches a small fourth area at Belgium's southernmost tip, Belgian Lorraine.\r\rThe coastal plain is mostly sand dunes and polders. Further inland is a smooth, slowly rising landscape. There are fertile valleys. The hills have many forests. The plateaus of the Ardennes are more rough and rocky. They have caves and small, narrow valleys. Signal de Botrange is the country's highest point at 694 metres (2,277 ft).\r\rProvinces\rBelgium is divided into three Regions. Flanders and Wallonia are divided into provinces. The third Region, Brussels is not part of any province.\r\rMilitary\rThe Belgian Armed Forces have about 46,000 active troops. In 2009 the yearly defence budget was $6 billion. There are four parts: Belgian Land Component, or the Army; Belgian Air Component, or the Air Force; Belgian Naval Component, or the Navy; Belgian Medical Component.\r\rScience and technology\rGerardus Mercator\r\rAdding to science and technology has happened throughout the country's history. cartographer Gerardus Mercator, anatomist Andreas Vesalius, herbalist Rembert Dodoens and mathematician Simon Stevin are among the most influential scientists.\r\rChemist Ernest Solvay and engineer Zenobe Gramme gave their names to the Solvay process and the Gramme dynamo in the 1860s. Bakelite was formed in 1907–1909 by Leo Baekeland. A major addition to science was also due to a Belgian, Georges Lemaître. He is the one who made the Big Bang theory of the start of the universe in 1927.\r\rThree Nobel Prizes in Physiology or Medicine were awarded to Belgians: Jules Bordet in 1919, Corneille Heymans in 1938 and Albert Claude together with Christian De Duve in 1974. Ilya Prigogine was awarded the Nobel Prize in Chemistry in 1977. Two Belgian mathematicians have been awarded the Fields Medal: Pierre Deligne in 1978 and Jean Bourgain in 1994. (Retrieved: November 10, 2011) (Retrieved: November 10, 2011)\r\rIn February 2014, Belgium became the first country in the world to legalize euthanasia without any age limits.\r\rCulture\rFine arts\rThe Ghent Altarpiece: The Adoration of the Mystic Lamb (inside view), painted 1432 by van Eyck\r\rThere have been many additions to painting and architecture. Several examples of major architectural places in Belgium belong to UNESCO's World Heritage List. In the 15th century the religious paintings of Jan van Eyck and Rogier van der Weyden were important. The 16th century had more styles such as Peter Breughel's landscape paintings and Lambert Lombard's showing of the antique. The style of Peter Paul Rubens and Anthony van Dyck was strong in the early 17th century in the Southern Netherlands.\r\rDuring the 19th and 20th centuries many original romantic, expressionist and surrealist Belgian painters started. These include James Ensor and other artists in the Les XX group, Constant Permeke, Paul Delvaux and René Magritte. The sculptor Panamarenko is still a remarkable figure in contemporary art.—List of Belgian painters, linking to their biographies and artworks The artist Jan Fabre and the painter Luc Tuymans are other internationally known figures in contemporary art.\r\rBelgian contributions to architecture were also in the 19th and 20th centuries. Victor Horta and Henry van de Velde were major starters of the Art Nouveau style.\r\rIn the 19th and 20th centuries, there were major violinists, such as Henri Vieuxtemps, Eugène Ysaÿe and Arthur Grumiaux. Adolphe Sax invented the saxophone in 1846. The composer César Franck was born in Liège in 1822. Newer music in Belgium is also famous. Jazz musician Toots Thielemans and singer Jacques Brel have made global fame. In rock/pop music, Telex, Front 242, K's Choice, Hooverphonic, Zap Mama, Soulwax and dEUS are well known. In the heavy metal scene, bands like Machiavel, Channel Zero and Enthroned have a worldwide fan-base.\r\rBelgium has several well-known authors, including the poet Emile Verhaeren and novelists Hendrik Conscience, Georges Simenon, Suzanne Lilar and Amélie Nothomb. The poet and playwright Maurice Maeterlinck won the Nobel Prize in literature in 1911. The Adventures of Tintin by Hergé is the best known of Franco-Belgian comics. Many other major authors, including Peyo, André Franquin, Edgar P. Jacobs and Willy Vandersteen brought the Belgian cartoon strip industry a worldwide fame.\r\rBelgian cinema has brought a number of mainly Flemish novels to life on-screen. Belgian directors include André Delvaux, Stijn Coninx, Luc and Jean-Pierre Dardenne. Well-known actors include Jan Decleir and Marie Gillain. Successful films include Man Bites Dog and The Alzheimer Affair.\r\rCuisine\rBrussels waffles, commonly known as Belgian waffles outside of Belgium\rBelgium is famous for beer, chocolate, waffles and french fries. French fries were first made in Belgium. The national dishes are \"steak and fries with salad\", and \"mussels with fries\".\rOther local fast food dishes include a Mitraillette. Brands of Belgian chocolate and pralines, like Côte d'Or, Guylian, Neuhaus, Leonidas, Corné and Galler are famous. Belgium makes over 1100 varieties of beer. The Trappist beer of the Abbey of Westvleteren has repeatedly been rated the world's best beer. The biggest brewer in the world by volume is Anheuser-Busch InBev, based in Leuven.\r\rSports\rKim Clijsters was WTA Player of the Year in 2005 and 2010\r\rSince the 1970s, sports clubs are organised separately by each language community. Association football is one of the most popular sports in both parts of Belgium, together with cycling, tennis, swimming and judo. With five victories in the Tour de France and many other cycling records, Belgian Eddy Merckx is said to be one of the greatest cyclists of all time. Jean-Marie Pfaff, a former Belgian goalkeeper, is said to be one of the greatest in the history of football (soccer).\"[http://www.goalkeepersaredifferent.com/keeper/goalkeeping_greats.htm Goalkeeping Greats]\" Goalkeepersaredifferent.com. Retrieved on 2008 Belgium and The Netherlands hosted the UEFA European Football Championship in 2000. Belgium hosted the 1972 European Football Championships.\r\rKim Clijsters and Justine Henin both were Player of the Year in the Women's Tennis Association. The Spa-Francorchamps motor-racing circuit hosts the Formula One World Championship Belgian Grand Prix. The Belgian driver, Jacky Ickx, won eight Grands Prix and six 24 Hours of Le Mans. Belgium also has a strong reputation in motocross. Sporting events held each year in Belgium include the Memorial Van Damme athletics competition, the Belgian Grand Prix Formula One, and a number of classic cycle races such as the Tour of Flanders and Liège–Bastogne–Liège. The 1920 Summer Olympics were held in Antwerp.\rRelated pages\rBelgium at the Olympics\rBelgium national football team\rList of rivers of Belgium\r\rReferences\rOther websites \r[http://www.monarchie.be Official website of Belgian monarchy]\r[http://www.belgium.be Official website of the Belgian federal government]\r[http://www.telefoongids.2link.be Belgian Telephone directory]\r[http://www.traveldir.org/belgium/ Belgium Travel Guide] \r[http://www.ilotsacre.be/site/en/default_en.htmref Brussels map]\r\r\rCategory:European Union member states\rCategory:Benelux\rCategory:Current monarchies\rCategory:Dutch-speaking countries\rCategory:French-speaking countries\rCategory:German-speaking countries\rCategory:Federations",
                "docDate": 1619708678000,
                "domain": "s.wikipedia.org",
                "title": "Belgium ",
                "url": "http://s.wikipedia.org/wiki/Belgium",
                "_id": "55",
                "_highlights": {
                    "content": "In rock/pop music, Telex, Front 242, K's Choice, Hooverphonic, Zap Mama, Soulwax and dEUS are well known. In the heavy metal scene, bands like Machiavel, Channel Zero and Enthroned have a worldwide fan-base."
                },
                "_score": 0.6035337
            },
            {
                "content": "Hubble - infant galaxy\r\rCosmology is the branch of astronomy that deals with the origin, structure, evolution and space-time relationships of the universe. NASA defines cosmology as \"The study of the structure and changes in the present universe\". Another definition of cosmology is \"the study of the universe, and humanity's place in it\".\r\rModern cosmology is dominated by the Big Bang theory, which brings together observational astronomy and particle physics. \r\rThough the word cosmology is recent (first used in 1730 in Christian Wolff's Cosmologia Generalis), the study of the universe has a long history.\r\rHistory\rUntil recently, people thought that the universe was only the Milky Way galaxy. They thought this because they could only see the planets up to Saturn and stars. With the invention of the telescope, we could see more of the universe. Even in the 20th century, people thought that the Milky Way was the entire universe. With the Hubble Space Telescope, people could see things far away.\r\rModern cosmology is considered to have started in 1917 with the final paper of Albert Einstein's theory of general relativity. This paper was known as \"Cosmological Considerations of the General Theory of Relativity\" which made physicists start to change the assumption that the Universe never changed. When a scientific discipline begins to change an idea that is believed by many people, it is known as a paradigm shift. During this paradigm shift, the Great Debate took place. Many scientists debated if there were other galaxies. The debate ended when Edwin Hubble found Cepheid Variables in the Andromeda Galaxy in 1926.\r\rThe Big Bang model was then created by Belgian priest, Georges Lemaître in 1927. This was supported by Edwin Hubble's discovery of the redshift in 1929 and later by the discovery of cosmic microwave background radiation. This was found by Arzo Penzias and Robert Woodrow Wilson in 1964. \r\rAll of these discoveries have been further supported throughout the 20th century. Some more observations of the cosmic microwave background radiation were found by the COBE, WMAP, and Planck satellites. Some more observations of the redshift were found by the 2dfGRS and SDSS. These are known as redshift surveys. Survey is this context refers to an astronomical survey. An astronomical survey is a place in space. A redshift survey is a survey that looks for redshifts.\r\rOn 1 December 2014, at the Planck 2014 meeting in Ferrara, Italy, astronomers reported that the universe is 13.8 billion years old and is composed of 4.9% regular matter, 26.6% dark matter and 68.5% dark energy.\r\rRelated pages\rString theory\rEarth Science\rInflation\r\rReferences \rCategory:Astrophysics\r",
                "docDate": 1614778542000,
                "domain": "s.wikipedia.org",
                "title": "Cosmology ",
                "url": "http://s.wikipedia.org/wiki/Cosmology",
                "_id": "73",
                "_highlights": {
                    "title": "Cosmology"
                },
                "_score": 0.6033569
            }
        ],
        "processingTimeMs": 2163,
        "query": "Space hippos",
        "limit": 30
    }
}